We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Great! Answers in-line in bold.  I'd also like to have some activities planned/paid for. Do you have pricing or details on the guided tours, tours on e-bike, massages, yoga, art class, etc.. that you mentioned?  Thank you so much for your help so far!  Best,  Zach  

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hello,  I'd love to get some information regarding packages and pricing options for hosting our wedding at the Big Sur River Inn!  We're looking to get married on, or around, November 8th 2025 with ~100 guests in attendance.  Thank you very much, Valerie and Cas 
Message 2 from the Events Team saying Hello Valerie and Cas,  Thank you for considering us for your wedding venue! We specialize in hosting unforgettable wedding weekends, from the Rehearsal Dinner to the Post-Wedding Breakfast.  We offer the following package year-round:  **Wedding Ceremony and Reception Package**  - Minimum of 75 guests, up to 250  - In-House Full-Wedding Planning  - Ceremony on the Lawn overlooking the Big Sur River  - 2 Patios for your reception  - Champagne Toast  - On-site Catering and Signature Crafted Cocktails  - Menu Tasting with Wine Pairing  - Dinner with Cocktail Hour and Dessert  - Private Outdoor Tiki Bar and Pool  - Indoor Dance Floor  - Full Property Venue rental starting at $10,000  -Lodging on property - 8 Riverside Suites and 14 guest rooms (overflow lodging nearby)  Consider adding these events for an epic Wedding Weekend:  - Welcome Cocktail Party  - Rehearsal Dinner  - Post-Wedding Brunch  - Post-Wedding Pool Party  If this sounds like something you are looking for, we would love to hear more details! I’ve included a few photos so you can get a feel for our vibe :)   Nov. 8, 2025 is reserved but I do have November 1 or November 15, 2025. Let me know if that would work for you.   Sincerely,  Breann   2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>    --  Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :) <https://www.bigsurriverinn.com/weather-and-live-camera>   
Message 3 from the Guest saying Hi Breann,  We are definitely interested! The photos are absolutely gorgeous. I’ve been to the River Inn several times growing up and it was always a fun and special experience! We’d likely lean towards the Nov 1st since the 8th is booked.  I would love to get a little more information on pricing breakdowns and what is included so we can confirm that this fits into our budget.  Thank you very much! Cas  
Message 4 from the Events Team saying Excellent! happy to hear that. River Inn is quite special for me too. Here's some more info to review. Some of your bigger costs to consider would be:  venue rental fee $10,000 Planning - Coordinator $3500 Food/Beverage tbd Rental Chairs $1000+  Happy to hop on a call sometime. Have a great night!  Breann   
Message 5 from the Events Team saying Hi Valerie and Cas, I hope you are having a great weekend so far. We updated our brochure and photos so I thought I'd send them over. Hope wedding planning is going well!  Please don't hesitate to reach out if you have any questions regarding River Inn or Big Sur in general.  Sincerely, Breann   weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>  
Message 6 from the Guest saying Hi Breann!  Unfortunately we've decided to go a different way. Thank you so much for the brochure! Good luck to you!  Thank you, Valerie and Cas  
Message 7 from the Events Team saying Thank you for letting me know! Good luck to you both and please come see us someday!  Breann  
Conversation 2 made up of 
Message 1 from the Guest saying Hi there,  Me and my partner (David Klech) are interested in your venue for an elopement with our parents 3/19/2025 (the date is flexible, but preferably during this week.).  We've spent many dates and memories in the Big Sur area, and would love to get married there.  Let us know if you have any availability and next steps.  Thanks, David Klech & Kristin Southard 
Message 2 from the Events Team saying Hi Kristin and David, We would love to be a part of your day. Wednesday, March 19, 2025 is available. I will get back to you on pricing. Weather is something to consider. That can be a rainy time.  I will reach back out with more information!  Sincerely, Breann  
Message 3 from the Guest saying Hi Breann,  Hope all is well and thank you for getting back to us! Just wanted to check in, do you have any more details on pricing that we could review? We are excited to hear a bit more about the venue and what options there may be for us with the smaller group of people in one of our favorite places!  Thank you, Krisitn & David  
Message 4 from the Events Team saying Hi David and Kristin, I have a special elopement option that would be perfect for you, I think. I don't have exact costs but it's somewhere around $2500 (based on four guests), after taxes and service charges. And we can add any additional rooms needed.   “The Perfect Day” Elopement: Ceremony on the Lawn overlooking the Big Sur River, up to 10 guests. Includes chairs Professional Officiant Champagne Toast 4- course Dinner for 4 guests Chocolate Covered Strawberries and bottle of wine or Champagne in your suite One night in a Honeymoon Suite, riverside (1 suite included)  **A local florist is available to create a bouquet and boutonniere. River Inn can facilitate that for you, as well as any other amenities, such as live music at the ceremony.  Let me know what you think!  Sincerely, Breann  
Message 5 from the Guest saying Hi Breann,  Thank you for all the information.  Your "The Perfect Day" Elopement package looks AMAZING.   It'd be great to jump on a call or video call soon, (we actually may drive down to Big Sur on Saturday just to check out via a drive by).  I may also be jumping the gun, (but do you have any availability that Saturday (3/22/2025) for a separate reception?  Thank you, David & Kristin  
Message 6 from the Events Team saying We do have that Saturday available as well. We would definitely need to talk about a contingency plan in case of rainy weather.  I am available Saturday if you'd like to come check it out with me, or you can come anytime to sneak a peek :)  As for a call, how about tomorrow? Or if you're coming down, we can chat then.  Thank you! Breann  
Message 7 from the Guest saying Hi Breann,  Thanks for the quick response.  That's awesome to hear that you're available on that date.  Our plan is to come out on Saturday if you have any availability in the afternoon (David has to work in the morning in Santa Cruz but we could be out there around 2:30PM if that works for you, we can potentially try and move things around if needed.)  Thanks, Kristin & David  
Message 8 from the Events Team saying Hi Kristin and David, That seems fine! Let's set up a consult call at your convenience. We'll work out the logistics and I can answer any questions you might have, as well as go over pricing.  Looking forward to working with you both! Let's hop over to my direct email: breann@bigsurriverinn.com. Thank you!  Sincerely, Breann  
Conversation 3 made up of 
Message 1 from the Guest saying Hello,  We are in the early stages of planning our wedding. We are looking to have 150 people for a wedding weekend with events on Friday and Saturday nights and Sunday morning. Ideally we will have as many people stay on site as possible. We are flexible on dates and aiming for fall 2025 or spring 2026. Are you able to provide information about your capacity and pricing?  Thank you! Sasha and Karam 
Message 2 from the Events Team saying Sasha and Karam,  Good morning! So so sorry! I missed this somehow. Big aologies. We would love a chance to still be considered for your wedding weekend venue! We have 22 guest rooms on property and can host over multiple days. There is overflow lodging nearby. Even if you don't choose River Inn, my personal recommendation is Fall. It's the best season in my opinion. Consider early to mid October. Spring can be iffy...rainy and windy. I would steer clear. I hope this helps! Have a great day!  Sincerely, Breann   June/July 2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>     
Message 3 from the Guest saying Thanks Breann and appreciate the helpful tip! Would you be able to provide more info on the package/venue pricing, event spaces, etc?  Thanks! Karam  
Message 4 from the Events Team saying Hi Karam I've provided a cost breakdown <https://docs.google.com/spreadsheets/d/1zvnQioqiJeF2_COLxuYs-w2EXnLPjExLJUzEfIgVL_8/edit?gid=1924295023#gid=1924295023>if you were to host 3 events at River Inn. You'll find taxes and service charges towards the bottom. The total includes:  Site Fees x 3 days (Full Property) Food and Beverage x 3 days Taxes Service Charges  Any questions, please let me know!  Current Catering Menu <https://docs.google.com/document/d/10sgqbUlJEvk3U05Z6cduTZrjtxdimlZvZN8S00dcnMo/edit> Bar Menu <https://docs.google.com/document/d/1QLVij8ayJV-Q2GB6uwsOitH-ins2IKBG9vYetKQE7jI/edit>  Some weekends to consider: September 26-28, 2025 October 3-5, 2025 October 17-19, 2025  Breann      
Message 5 from the Guest saying Great thanks for all the info!  Best, Karam  

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hi again, Happy Saturday! I think we would only need accommodations for the Friday and Saturday night not the rehearsal dinner/ welcome dinner.  We will likely have some people camping, and do a little gathering at the campsite instead. Our wedding will be on Saturday at Loma Vista. We haven’t sent our invitations yet, and really are not sure how many people would require accommodations yet. Thinking it could be around 20-30 people. If you could send me information about reserving a block for up to 30 people that would be so fantastic. Thank you!EmmaSent from my iPhoneOn Nov 2, 2024, at 1:24 PM, Events Team <events@bigsurriverinn.com> wrote:﻿We do have that weekend available!How many guests are you thinking of inviting? Assuming you would host a rehearsal dinner or welcome party at River Inn and then get married at a different venue on Saturday? 

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hi there,  Do you have any more information, photos, pricing or package details for your wedding offerings?  Thanks! Natalie 
Message 2 from the Events Team saying Hello Natalie!   Thank you for considering us for your wedding venue! We specialize in hosting unforgettable wedding weekends, from the Rehearsal Dinner to the Post-Wedding Breakfast.  We offer the following package year-round:  **Wedding Ceremony and Reception Package**  - Minimum of 75 guests, up to 250  - In-House Full-Wedding Planning  - Ceremony on the Lawn overlooking the Big Sur River  - 2 Patios for your reception  - Champagne Toast  - On-site Catering and Signature Crafted Cocktails  - Menu Tasting with Wine Pairing  - Dinner with Cocktail Hour and Dessert  - Private Outdoor Tiki Bar and Pool  - Indoor Dance Floor  - Full Property Venue rental starting at $10,000  -Lodging on property - 8 Riverside Suites and 14 guest rooms (overflow lodging nearby)  Consider adding these events for an epic Wedding Weekend:  - Welcome Cocktail Party  - Rehearsal Dinner  - Post-Wedding Brunch  - Post-Wedding Pool Party   If this sounds like something you are looking for, we would love to hear more details! I’ve included a few photos and our current menu so you can get a feel for our vibe :)   Sincerely,  Events Team   2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>    
Message 3 from the Guest saying Hi there!  Thanks for sending all this info!  I love the idea of a wedding weekend from rehearsal dinner to post wedding brunch and pool party!  Our wedding would be for about 125 people. How many people can stay on site and are there other accommodations close by?  What is the curfew of the venue?  Would you be able to send a pricing brochure for the venue rental as well as accommodations?  We would be interested in having food stations with specific food items - is this something your team would be able to accommodate?  Thanks so much! Natalie  
Message 4 from the Events Team saying No problem! Yes, wedding weekends are so ridiculously fun! Approximately 45-65 guests can stay on site and the overflow typically books at Big Sur Lodge, located in Pfeiffer State Park (2 miles south). They have over 100 rooms so no need for a room block over there. Just let your guests know what's recommended.I can arrange a shuttle service loop throughout the entire weekend. We do put a room block in place for you at River Inn.  We do not have an official curfew but we do have a noise ordinance. No music outside after 8pm. We've been able to party indoors until midnight with no issue.  Venue rentals fluctuates by date so we'd have to narrow that down but if you're thinking a Saturday in the warmer months, July-September....your fees to reserve the property would look something like this:      - Rehearsal Dinner and Welcome Party on Friday $4000 + food/bev  choice of:     - Evening Event 5-10pm $10,000           ( 5-5:30 guest arrival, 5:30 ceremony, 5:45-7 cocktail hour, 7-8 dinner, 8-10pm dancing and dessert indoors)      - 4-10pm $12,000 (extra hour of cocktail hour or dancing!)       - All Day Saturday $15,000 + food/bev  Lodging Pricing: Single Queen $345/night Double Queen $395/night Riverside Suite $515/night  We can absolutely do food stations! I have lots of ideas!   
Message 5 from the Events Team saying Hi Natalie, I hope you are having a great weekend so far. We updated our brochure and photos so I thought I'd send them over. Hope wedding planning is going well!  Please don't hesitate to reach out if you have any questions regarding River Inn or Big Sur in general.  Sincerely, Breann   weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>  
Conversation 2 made up of 
Message 1 from the Guest saying Hi there!  Curious if you have availability for Sept 13th, 2025 for a wedding? It would be for about 80 people and we would need to include some lodging as well please. Curious on pricing for the venue, do you provide tables & chairs & food? Would a live band be possible?  Thank you!  Ashley  [cid:9dd0713f-b453-488a-acb8-941debbf777b] 
Message 2 from the Events Team saying Hi Ashley!  Thanks for your email. We are booked on 9/13/25 but we do have the following weekend available, if you're flexible. Venue site fee would be $10,000-$12,000 plus food/bar (estimated at $150/person). We love live bands! We have an expansive "backyard" with lots of room for an epic party. We provide Redwood tables and we rent chairs for your ceremony and reception. I've included some photos of past weddings as well as our Live Lawn Cam <https://www.bigsurriverinn.com/weather-and-live-camera>. Let me know if I can answer any more questions for you. Have a great evening!  Breann   weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>  
Message 3 from the Guest saying Hi Breann,  Thank you! I appreciate the additional information and photos. They're very helpful! That next weekend is my birthday weekend ;p  Any chance the weekend before, Sept 6th is open or August 30th?  Do you include special pricing for lodging at the Big Sur Inn for the night before and night of the wedding? Does the Big Sur Inn have any suites for my fiancée and I?  Kind regards,  Ashley ________________________________ From: Events Team <events@bigsurriverinn.com> Sent: Tuesday, October 1, 2024 6:18 PM To: Ashley Wayland <ashley@waylandproperties.co> Subject: Re: Sept 13, 2025 Wedding at the Inn  Hi Ashley!  Thanks for your email. We are booked on 9/13/25 but we do have the following weekend available, if you're flexible. Venue site fee would be $10,000-$12,000 plus food/bar (estimated at $150/person). We love live bands! We have an expansive "backyard" with lots of room for an epic party. We provide Redwood tables and we rent chairs for your ceremony and reception. I've included some photos of past weddings as well as our Live Lawn Cam<https://urldefense.proofpoint.com/v2/url?u=https-3A__www.bigsurriverinn.com_weather-2Dand-2Dlive-2Dcamera&d=DwMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=uRR-G4UH65ZJEZEW1V3p18fB-VFOjLFygWRLuAZ9tts&m=r9oF3tXPjFIGB5yKFNM5mbDv5TP_AAT7p4FOmJ6H26k96G81kPueiFZqIg-K_23t&s=KWaT0Y4nP5kdCFPxKMjFHK874enDyoAd2l7GaeGt-K8&e=>. Let me know if I can answer any more questions for you. Have a great evening!  Breann  [https://drive-thirdparty.googleusercontent.com/32/type/application/vnd.google-apps.folder+shared] weddings 2024<https://urldefense.proofpoint.com/v2/url?u=https-3A__drive.google.com_open-3Fid-3D1mQsfnWom17idqD1QzYySwKVI98-2DqoSeT&d=DwMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=uRR-G4UH65ZJEZEW1V3p18fB-VFOjLFygWRLuAZ9tts&m=r9oF3tXPjFIGB5yKFNM5mbDv5TP_AAT7p4FOmJ6H26k96G81kPueiFZqIg-K_23t&s=9DGoZ5wIDSlySMve75Up0hrzygRX3yLrCn1a8-bvFYo&e=>  
Message 4 from the Events Team saying Hi Ashley We do have September 6, 2025 available!! There will be special pricing for lodging as well. Our motel room prices fluctuate and likely to increase during that time. So we lock in our moderate rates at: Single Queen Rooms at $345 Double Queen Rooms at $395 Riverside Suites at $515 *we do have a suite we save for the bride and groom that doubles as your bridal suite to get ready. We do require that all of our rooms are bought out by wedding guests- there are 22 rooms. It sounds like we may be able to have your whole party stay on property. If we need overflow rooms, there’s a lovely lodge 2 miles south, located in Pfeiffer State Park. I would love to hear more details about your wedding! Have a great day, Breann    Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :) <https://www.bigsurriverinn.com/weather-and-live-camera>    
Message 5 from the Guest saying Hi Breann!  September 6th is a great option for us. Any chance you have the last weekend of August open, August 30th for the wedding?  We are looking at 80 guests max for the wedding. Would love to have a quick ceremony on the back lawn area. Do you have chairs or is that something that we would need to rent? Similar question for the reception...I believe that you mentioned having the live edge tables. Do you have chairs available as well?  Could we get some more detailed info about the site fee and what our options are for catering and beverages? I know that you have a bar area out there... We'd maybe want a period of time where we cover beverages and then the remaining time guests are responsible for their own beverages?  Thank you!  Ashley ________________________________ From: Events Team <events@bigsurriverinn.com> Sent: Thursday, October 3, 2024 10:09 AM To: Ashley Wayland <ashley@waylandproperties.co> Subject: Re: Sept 13, 2025 Wedding at the Inn  Hi Ashley We do have September 6, 2025 available!! There will be special pricing for lodging as well. Our motel room prices fluctuate and likely to increase during that time. So we lock in our moderate rates at: Single Queen Rooms at $345 Double Queen Rooms at $395 Riverside Suites at $515 *we do have a suite we save for the bride and groom that doubles as your bridal suite to get ready. We do require that all of our rooms are bought out by wedding guests- there are 22 rooms. It sounds like we may be able to have your whole party stay on property. If we need overflow rooms, there’s a lovely lodge 2 miles south, located in Pfeiffer State Park. I would love to hear more details about your wedding! Have a great day, Breann    Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :)<https://urldefense.proofpoint.com/v2/url?u=https-3A__www.bigsurriverinn.com_weather-2Dand-2Dlive-2Dcamera&d=DwMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=uRR-G4UH65ZJEZEW1V3p18fB-VFOjLFygWRLuAZ9tts&m=V6cjI1gBZ1BYqa_aEXo6ybWUOxxPr_c5gNk5NhYa9lLTPVRuYKGzQgZ4AGbkOWBi&s=iwYjmU4mVQAuxHMRV8kPGo9Qz6MD6oGRtZlo9mWzRSs&e=> [https://ci3.googleusercontent.com/mail-sig/AIorK4zWa5eqaWwXuo8Hy-AREqvkf5f8kvRYc3dkj8s7ZMnU0fwyWScTvmZ-oetcF_AlDy4jrT2DmrpJcp8r]   
Conversation 3 made up of 
Message 1 from the Guest saying Hello!My husband and I had a courthouse ceremony a little over 2 years ago and are now finally planning our wedding ceremony/celebration at the Loma Vista Gardens on 9/26/25. We visited Big Sur in 2023 and ate at your establishment multiple times. We always had a wonderful time; great food and wonderful service. We would love for our family and friends to experience the same! We are planning on having less than 50 guests at our wedding (closer to 30-40) and would love to have our rehearsal dinner at your establishment. Would you happen to have availability for a rehearsal dinner on 9/25/25? Also, do you do room blocks for weddings?Thank you and we look forward to hearing back from you!
Message 2 from the Guest saying Hello,  I just wanted to follow up on my previous email, I did not receive a response.  Thank you! Kelly  > On Oct 6, 2024, at 7:45 PM, Kelly Bear <kellybear11@yahoo.com> wrote: >  > ﻿ > Hello! > My husband and I had a courthouse ceremony a little over 2 years ago and are now finally planning our wedding ceremony/celebration at the Loma Vista Gardens on 9/26/25. We visited Big Sur in 2023 and ate at your establishment multiple times. We always had a wonderful time; great food and wonderful service. We would love for our family and friends to experience the same! We are planning on having less than 50 guests at our wedding (closer to 30-40) and would love to have our rehearsal dinner at your establishment. Would you happen to have availability for a rehearsal dinner on 9/25/25? Also, do you do room blocks for weddings? > Thank you and we look forward to hearing back from you! 
Message 3 from the Events Team saying Hello Kelly, Thank you for your email!  We are delighted that you had a great time at the River Inn. And we would love to be considered for your rehearsal dinner!  We do have availability on Thursday, September 25, 2025 for your rehearsal dinner. Our private space rentals are $3500 (+food/bev, tax, service charges) for three hours and includes the following:  Private space indoors on our heated, covered patio Personal Venue Coordinator Lawn on the Big Sur River for use - Lawn Games, Cocktail hour available... Two couches with fireplace - seating area indoors Redwood Tables 3’ x 3’ Redwood Tables 4’ and 6’ White or Ivory Linen tablecloths and napkins Basic Plates, Glassware and Silverware Setting of Dinner Tables and Cleanup after meal Fruit Infused Water Station Welcome Courtyard for Guest Arrival Plenty of parking and room for shuttles and buses Market Lighting above Reception Tables Space Heaters Restrooms Cleanup of event  Our room blocks require an $8,000 event minimum. We would be happy to put together a quote for you. This event most likely will qualify for a 2-night room block. Below is some more information.  Please let us know if you have any questions. Talk soon!   

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Sounds great. I’m out of the country at the moment. Are you free for a phone call Nov. 13-16? Also happy to grab coffee, whatever’s easiest.  

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hi there, My name is Jasmin and I'm working with a prospective couple looking to explore options for wedding venues for next September. They love what the Big Sur River Inn has to offer for their special day which is why I'm reaching out! I wanted to provide a bit more context on what we're looking for and then schedule a call for us to connect in the next week or so. Would you send me a couple of times when you're available to connect, please? We're looking for our dream venue to have the following:     - Availability the weekend of 9/12-9/14 with the wedding ceremony taking    place on 9/14 from 10 am - 3/4 PM    - A ceremony and reception space that accommodates 150-175 individuals    - Options for catering either with provided onsite service or external    vendors for Friday night dinner, Saturday breakfast, lunch, and dinner, and    then meals on Sunday as well    - 50-60 units onsite or nearby to accommodate guests  We're excited to connect with you all and see what might be possible given the couples' vision for their wedding! I look forward to hearing from you soon!  Warmly, Jasmin 
Message 2 from the Events Team saying Jasmin, Hello and thank you for your email. Unfortunately, we are already booked for that weekend. This sounds like such a lovely weekend! Holly Farm (Carmel Valley) and Point 16 (Big Sur) may be able to accommodate you. I can connect you with Point 16's Event Manager if that helps. Good luck in your search!  Sincerely, Breann  
Message 3 from the Guest saying Hi there and thank you for getting back to me! Yes, please connect me with the manager. An introduction would be greatly appreciated.  Warmly, Jasmin  
Message 4 from the Guest saying Hi Breann,  I hope you're having a great week so far! I wanted to reach back out because the scope of our wedding weekend has changed.  We have a venue for Friday/Saturday events and are currently looking for a ceremony space for Sunday morning through 3 PM on 9/14. Would you all happen to have space for that Sunday morning/afternoon for 150 people?  We're contracting with Big Sur Lodge for the first part of the weekend but need a nice and big space for a ceremony and celebration that Sunday.  Look forward to hearing from you!  Warmly, jas  
Message 5 from the Events Team saying Hi Jas! That might work! Let me check on a few things and get back to you in the next couple of days.  Would you be able to hop on a call?  Thanks! Breann  
Message 6 from the Guest saying Hi there,  Absolutely. When are you free for a chat? You can always text me tomorrow to see if I'm available. 8605979305.  Warmly, Jas  
Message 7 from the Guest saying Before we connect, could you send me your wedding package brochures please so that I can review before we connect?  Thank you!  Warmly, Jas  
Conversation 2 made up of 
Message 1 from the Guest saying Hello Big Sur River inn events coordinator,   My name is Sierra and I was wondering if I could get more information on your venue. My fiancé Ethan and I have driven by many times and think your hotel is beautiful! We are planning to have about 100 people at our wedding and wanted to have a ceremony looking out at the river. We would like to get married in may or august of 2025. We were wondering what pricing was like for the venue as well as pricing for a reception at your restaurant. Also we saw that for parties you can do wedding cakes/ rental equipment/ photography and were wondering if you had any more information about that.   Thank you for your time,  Sierra and Ethan (702) 539-8747 Wardsm16@gmail.com
Message 2 from the Events Team saying Hello Sierra and Ethan, Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season.  Some of our offerings include, but not limited to: Event space for up to 250 guests A ceremony on the lawn overlooking the Big Sur River Exclusive use of our outdoor patios Market Lights and heaters Set-up and breakdown of tables and chairs Provision of linens, basic flatware, silverware, and glassware In-house Catering, custom menu planning Event planning assistance and day of Venue Coordinator A PA system for speeches, including a microphone with stand Access to our private River bar 22 guest rooms on property Heated Swimming Pool  For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  Looking forward to hearing more about your event!  Breann   
Message 3 from the Guest saying Hello Breann,  Thank you for getting back to us! We were wondering if we could schedule a call to discuss the wedding in further detail. Also we were wondering if we could schedule a tour. We are going to be in Big Sur in June on the 7th and 8th!  Thanks  Ethan and Sierra  > On May 15, 2024, at 1:57 PM, Events Team <events@bigsurriverinn.com> wrote: >  > Hello Sierra and Ethan, > Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  >  > We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season. >  > Some of our offerings include, but not limited to: > Event space for up to 250 guests > A ceremony on the lawn overlooking the Big Sur River > Exclusive use of our outdoor patios > Market Lights and heaters > Set-up and breakdown of tables and chairs > Provision of linens, basic flatware, silverware, and glassware > In-house Catering, custom menu planning > Event planning assistance and day of Venue Coordinator > A PA system for speeches, including a microphone with stand > Access to our private River bar > 22 guest rooms on property > Heated Swimming Pool >  > For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  >  > Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  >  > I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  >  > Looking forward to hearing more about your event! >  > Breann >  >  > 
Message 4 from the Events Team saying Great! Both of those dates work for me. In the meantime, a call would be awesome. Anytime this weekend or next week work for me.  Looking forward to connecting!  Breann  
Message 5 from the Events Team saying Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)  Breann cell: 831-333-6774  
Message 6 from the Guest saying Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 7 from the Guest saying Hey Breann! Hope you are doing well. We are super excited after our last conversation on the way home! We wanted to make sure we did not miss your message in case you did send over the contract? Let us know if there is anything we can do to help! Thanks! Ethan & Sierra On Jun 9, 2024, at 8:30 AM, Sierra Ward <wardsm16@gmail.com> wrote:﻿Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 8 from the Events Team saying Hi Ethan and Sierra! Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience! I did put your room block in place and your date on the books :)  Breann  
Message 9 from the Guest saying Hey Breann! Sounds great thank you! Sierra and Ethan On Jun 12, 2024, at 8:27 AM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Ethan and Sierra!Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience!I did put your room block in place and your date on the books :)Breann
Message 10 from the Guest saying Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan
Message 11 from the Events Team saying Hi! Let me know when you're available to do the invoice for Ethan and Sierra. Thanks! B  ---------- Forwarded message --------- From: Sierra Ward <wardsm16@gmail.com> Date: Mon, Jun 24, 2024, 10:46 AM Subject: Re: Wedding inquiry To: Events Team <events@bigsurriverinn.com>   Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan 
Message 12 from the Guest saying Hi Im in the office today until 2:30. Will you be in or should we schedule a call?  
Message 13 from the Events Team saying Hi Sierra,  Thank you for your patience!  Your contract is ready to go! I just emailed your invoice and your contract is attached. Please e sign when you're ready. After this, we can schedule a tasting as soon as our busy season is over.  Thank you   5.03.25 Croy/Ward wedding <https://docs.google.com/spreadsheets/d/1j4ttvQMURqXVfxSnWBwvSNGMnFvxHBrksjnLPbd199o/edit?usp=drive_web>  
Message 14 from the Guest saying Hey Breann and Daisy,   Thanks for getting back to us! We saw that the price on the contract is $10,000 but we were told while we were visiting the venue that the price was $8,000. Can we get this fixed before we sign?  Also we briefly touched upon splitting the payment into installments, how do we set that up? We are happy to do half now and half in a month or something like that.   Thanks  Sierra and Ethan
Message 15 from the Events Team saying Hi Sierra and Ethan, Oops, sorry about that. Good catch! I went ahead and adjusted the contract to reflect $8000 for your  5.3.25 buyout and changed the invoice to $4,000 due in 30 days. We'll touch base about the balance towards the end of summer. Thank you! Breann  
Message 16 from the Guest saying Hi Breann,  Thank you for sending that over! We paid the $4000 invoice and initialed the contract. Please let us know if we missed anything on the contract.   Is there a specific link our guests can use to reserve their rooms, we anticipate some will stay for more than just the one night.   Please let us know when you can and thanks for all your help! Sierra and Ethan 
Message 17 from the Guest saying Hey Breann!  I hope all is well, I just wanted to ask about how to reserve the rooms that are blocked off for our wedding weekend. Is there a link people should use to block off the days or do they need to call directly?  Thanks, Sierra Ward
Message 18 from the Events Team saying Hi Sierra, Your booking group code is : b190234  and the booking link below will take your guests directly to our website's booking page. A note: it will say that nothing is available until you add the dates at the top of the page. *https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04 <https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04>*  I cc'd mine and Daisy's direct emails so there's no more delay in our response.  One more note: if you have any questions about your lodging or if you're having trouble with the booking code, please contact Gabe, our Inn manager, at 831-667-2700.  Have a great weekend! Thank you!  Breann  
Message 19 from the Guest saying  Hi Breann and Daisy,  I hope you are doing well! We just wanted to touch base, to see if there’s anything else we should be doing with you two to prepare for the wedding.  Als if we can get a rough timeline on the day of that would be greatly appreciated!  Quick question do we need to get vendors approved by you? We are looking into our photographers and florist right now!  Thanks  Sierra and Ethan
Message 20 from the Events Team saying Thanks for emailing, Sierra. Daisy will be back tomorrow.  No need to get vendors approved. Just let us know when you hire them and we will add the info to your contract. Please don't hesitate to send them our contact info if they have questions regarding the layout or terms or anything at all.  A rough timeline of your day: 30 min - guest arrival 30 min. - Ceremony 90 min. - Photos and Cocktail Hour 60 min. - Dinner, Speeches? 90 min - Free Time  Hope this helps!Have a great day! Breann   
Message 21 from the Events Team saying Hi Sierra! I wanted to follow up on my last email. Would you be interested in having a phone chat soon? I realized you may not have gotten proper onboarding and I want to make sure you're feeling good and know what the next steps are. I'm flexible. Let me know! Have a great day! Breann  *I added my direct email for faster response time  
Message 22 from the Guest saying Hi Breann and Daisy  Thanks for emailing us back! We would love to have a chat soon about the nexts steps. Are you available anytime after 10 this Thursday?  Thanks,  Ethan and Sierra
Conversation 3 made up of 
Message 1 from the Guest saying Hi Breann, I wanted to follow up on the below. Let me know if a phone call would be easier. Thank you!! Sent from my iPhoneOn Aug 5, 2024, at 3:40 PM, Kelli Benton <kellimbenton@gmail.com> wrote:﻿﻿Hi Breann,Thank you for sending this over. I have a few things I wanted to clarify!!  I apologize in advance if these seem silly but want confirm I have everything right in comparison to my notes too. :)When we last spoke, we discussed possibly doing something lighter like only bagels and cream cheese with the bar tab or only the burritos and bar. However, we also talked about needing to only lock in the site rental and that food could be finalized closer to the event. I know it’s been a little while so no worries if that was an error but hoping that’s still an option and can be updated in the contract. Contract says 5 hour event contract, I assume that’s fine even though ours is shorter yeah? Can you confirm the time frames. You mentioned you could do 8am-11am since you were unable to lower the site fee but terms & conditions says the price is for 2 hours, and site fee details says lower patio 2 hours and 2 hours of lawn games. So I just want to make sure!!Regarding rooms, were you able to lock in the lower rate if our guests were to stay additional nights?I think that’s it for now🫣 Thank you! Sent from my iPhoneOn Jul 28, 2024, at 1:49 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Kelli!Thanks for your patience! I had to send the proposal through our food and beverage team. Take a look HERE.One note: we updated our terms and conditions on our contract. I put a strikethrough on the items that would not apply to your event. Hope you're doing well! Let me know if you have any questions.BreannP.S. Please contact me through my direct email for a more timely response :)breann@bigsurriverinn.com
Message 2 from the Guest saying Hi Kelli, Thanks for your patience! Let's do a call next week to solidify everything. I have an idea that might work for both of us :) Can you talk on Monday, Wednesday or Friday next week? Thanks! Breann  
Message 3 from the Guest saying Hi Breann, I’m available tomorrow (Monday). What times work for you? not sure that you can, but feel free to text me if it’s easier to set up that way (480) 570-6487.Sent from my iPhoneOn Aug 16, 2024, at 1:58 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:﻿Hi Kelli,Thanks for your patience! Let's do a call next week to solidify everything. I have an idea that might work for both of us :)Can you talk on Monday, Wednesday or Friday next week?Thanks!Breann
Message 4 from the Guest saying Hi Breann,This sounds like it could work!! Could we possibly put a card down for a drink tab part of the time? Also- I wanted to follow up to see if you were able to get approval for extending the rates to those who want to stay additional nights. And do the rates change throughout the week? Thinking some guests might come on Wednesday or Thursday!Thank you so much for this!! Sent from my iPhoneOn Aug 18, 2024, at 9:09 PM, Kelli Benton <kellimbenton@gmail.com> wrote:﻿Hi Breann, I’m available tomorrow (Monday). What times work for you? not sure that you can, but feel free to text me if it’s easier to set up that way (480) 570-6487.Sent from my iPhoneOn Aug 16, 2024, at 1:58 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:﻿Hi Kelli,Thanks for your patience! Let's do a call next week to solidify everything. I have an idea that might work for both of us :)Can you talk on Monday, Wednesday or Friday next week?Thanks!Breann
Message 5 from the Events Team saying Awesome! I'm so glad. Let's talk this week or next if you can and we can nail this down! Yes, a tab for drinks anytime during the weekend will be fine. As for the room block, I'm told the rates will extend automatically for 2 nights before start date and 2 nights after. I am unable to extend the actual block but the rooms will be available for the same rate.  Talk to you soon. Looking forward to working together :)  Breann  
Message 6 from the Guest saying Amazing!! I’m so excited!! Are these rooms on hold or will they not be on hold until we lock it in?  My days off are Sunday/Monday so free whenever those days but always happy to work around your schedule too. Let me know a few days/times that work best. :) On Sep 8, 2024, at 11:55 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Awesome! I'm so glad. Let's talk this week or next if you can and we can nail this down! Yes, a tab for drinks anytime during the weekend will be fine. As for the room block, I'm told the rates will extend automatically for 2 nights before start date and 2 nights after. I am unable to extend the actual block but the rooms will be available for the same rate. Talk to you soon. Looking forward to working together :)Breann
Message 7 from the Events Team saying Glad it's all working out. They are on hold and I have a booking code that you can share with your guests. I will get back with you this week to finalize everything.  Have a great night!  Breann   
Message 8 from the Guest saying Hi Breann! I wanted to follow up on the booking code and anything else I need to get this finalized. Our RSVPs are going out so would love to do this asap! Happy to hop on a call if needed.Thank you again for everything - We’re so excited!! Kelli Benton(480) 570-6487Sent from my iPhoneOn Sep 13, 2024, at 7:14 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Glad it's all working out. They are on hold and I have a booking code that you can share with your guests. I will get back with you this week to finalize everything. Have a great night!Breann
Message 9 from the Guest saying Hi Kelli! Your booking code and booking link are below. Test them out when you have a sec. The website will say "no rooms available" before you add the dates to the booking code. Let me know if you have questions. I will send an invoice shortly for $1750 for (70) $25 gift cards. The GCs are paper so we will hold onto them for you until we can hand them off to you. Does that work?  Excited for you! Breann  b845635 https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b845635#checkin=&checkout=  
Message 10 from the Guest saying Hi again! I was just double checking your room block and the dates were incorrect so I just sent out an email for the front desk to fix the date. Give them 12 hours to fix since the office is closed at the moment.  Thanks!  
Message 11 from the Guest saying Oh! Can you confirm what nights we’re securing? It seemed to work when I checked so want to make sure we have the same nights :) Sent from my iPhoneOn Sep 24, 2024, at 6:02 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:﻿Hi again! I was just double checking your room block and the dates were incorrect so I just sent out an email for the front desk to fix the date. Give them 12 hours to fix since the office is closed at the moment. Thanks!
Message 12 from the Guest saying It actually might be right lol.. June 19 and 20th for staying over, checking out on June 21?  
Message 13 from the Guest saying Yes!! But we talked about some guests wanting to check in or out earlier. Would they call in to extend that? Sent from my iPhoneOn Sep 24, 2024, at 7:09 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:﻿It actually might be right lol..June 19 and 20th for staying over, checking out on June 21?
Message 14 from the Guest saying Ok, right. Sorry about that! Guests can book online to extend or call the front desk. Gabe is our Inn manager and he is very helpful if you have any questions moving forward about the lodging part. 831-667-2700  Have a great day!  
Message 15 from the Guest saying Thank you! Do you have a rooming list that I can use to keep track?    Sent from my iPhone  > On Sep 24, 2024, at 5:53 PM, Breann Fortier <breann@bigsurriverinn.com> wrote: >  > b845635 
Message 16 from the Guest saying Oh! And one more thing (sorry) what room type is room 23 that you recommended? Sent from my iPhoneOn Sep 24, 2024, at 8:19 PM, Kelli Benton <kellimbenton@gmail.com> wrote:﻿Yes!! But we talked about some guests wanting to check in or out earlier. Would they call in to extend that? Sent from my iPhoneOn Sep 24, 2024, at 7:09 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:﻿It actually might be right lol..June 19 and 20th for staying over, checking out on June 21?
Message 17 from the Events Team saying Hello! This rooming list should help. I can send you a screenshot of who has booked so far, every couple of months...the front desk will not be able to give out any information about your guests' booking so reach out to me for the list.  Room 23 is a riverside suite.  Hope you are well!  Breann  
Message 18 from the Guest saying Amazing- thank you!!Sent from my iPhoneOn Oct 8, 2024, at 3:35 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Hello!This rooming list should help. I can send you a screenshot of who has booked so far, every couple of months...the front desk will not be able to give out any information about your guests' booking so reach out to me for the list. Room 23 is a riverside suite.Hope you are well!Breann

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hello,  My name is Annette Reich and I am interested in hosting my wedding reception at Big Sur River Inn. As directed by the website, I am emailing this address to hopefully learn of rates and scheduling.  Currently, we are looking at Summer of 2025. Our party would not exceed thirty people. We are looking forward to hearing from you!   Thank you, Annette Reich & Jagger King  

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hello,  My name is Annette Reich and I am interested in hosting my wedding reception at Big Sur River Inn. As directed by the website, I am emailing this address to hopefully learn of rates and scheduling.  Currently, we are looking at Summer of 2025. Our party would not exceed thirty people. We are looking forward to hearing from you!   Thank you, Annette Reich & Jagger King  
Message 2 from the Events Team saying Hi Annette and Jagger, Have you decided on which month of summer works for you? I would be happy to provide you with available dates with pricing...  Have a great weekend!  Breann   weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>  
Conversation 2 made up of 
Message 1 from the Guest saying Hello Big Sur River inn events coordinator,   My name is Sierra and I was wondering if I could get more information on your venue. My fiancé Ethan and I have driven by many times and think your hotel is beautiful! We are planning to have about 100 people at our wedding and wanted to have a ceremony looking out at the river. We would like to get married in may or august of 2025. We were wondering what pricing was like for the venue as well as pricing for a reception at your restaurant. Also we saw that for parties you can do wedding cakes/ rental equipment/ photography and were wondering if you had any more information about that.   Thank you for your time,  Sierra and Ethan (702) 539-8747 Wardsm16@gmail.com
Message 2 from the Events Team saying Hello Sierra and Ethan, Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season.  Some of our offerings include, but not limited to: Event space for up to 250 guests A ceremony on the lawn overlooking the Big Sur River Exclusive use of our outdoor patios Market Lights and heaters Set-up and breakdown of tables and chairs Provision of linens, basic flatware, silverware, and glassware In-house Catering, custom menu planning Event planning assistance and day of Venue Coordinator A PA system for speeches, including a microphone with stand Access to our private River bar 22 guest rooms on property Heated Swimming Pool  For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  Looking forward to hearing more about your event!  Breann   
Message 3 from the Guest saying Hello Breann,  Thank you for getting back to us! We were wondering if we could schedule a call to discuss the wedding in further detail. Also we were wondering if we could schedule a tour. We are going to be in Big Sur in June on the 7th and 8th!  Thanks  Ethan and Sierra  > On May 15, 2024, at 1:57 PM, Events Team <events@bigsurriverinn.com> wrote: >  > Hello Sierra and Ethan, > Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  >  > We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season. >  > Some of our offerings include, but not limited to: > Event space for up to 250 guests > A ceremony on the lawn overlooking the Big Sur River > Exclusive use of our outdoor patios > Market Lights and heaters > Set-up and breakdown of tables and chairs > Provision of linens, basic flatware, silverware, and glassware > In-house Catering, custom menu planning > Event planning assistance and day of Venue Coordinator > A PA system for speeches, including a microphone with stand > Access to our private River bar > 22 guest rooms on property > Heated Swimming Pool >  > For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  >  > Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  >  > I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  >  > Looking forward to hearing more about your event! >  > Breann >  >  > 
Message 4 from the Events Team saying Great! Both of those dates work for me. In the meantime, a call would be awesome. Anytime this weekend or next week work for me.  Looking forward to connecting!  Breann  
Message 5 from the Events Team saying Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)  Breann cell: 831-333-6774  
Message 6 from the Guest saying Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 7 from the Guest saying Hey Breann! Hope you are doing well. We are super excited after our last conversation on the way home! We wanted to make sure we did not miss your message in case you did send over the contract? Let us know if there is anything we can do to help! Thanks! Ethan & Sierra On Jun 9, 2024, at 8:30 AM, Sierra Ward <wardsm16@gmail.com> wrote:﻿Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 8 from the Events Team saying Hi Ethan and Sierra! Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience! I did put your room block in place and your date on the books :)  Breann  
Message 9 from the Guest saying Hey Breann! Sounds great thank you! Sierra and Ethan On Jun 12, 2024, at 8:27 AM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Ethan and Sierra!Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience!I did put your room block in place and your date on the books :)Breann
Message 10 from the Guest saying Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan
Message 11 from the Events Team saying Hi! Let me know when you're available to do the invoice for Ethan and Sierra. Thanks! B  ---------- Forwarded message --------- From: Sierra Ward <wardsm16@gmail.com> Date: Mon, Jun 24, 2024, 10:46 AM Subject: Re: Wedding inquiry To: Events Team <events@bigsurriverinn.com>   Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan 
Message 12 from the Guest saying Hi Im in the office today until 2:30. Will you be in or should we schedule a call?  
Message 13 from the Events Team saying Hi Sierra,  Thank you for your patience!  Your contract is ready to go! I just emailed your invoice and your contract is attached. Please e sign when you're ready. After this, we can schedule a tasting as soon as our busy season is over.  Thank you   5.03.25 Croy/Ward wedding <https://docs.google.com/spreadsheets/d/1j4ttvQMURqXVfxSnWBwvSNGMnFvxHBrksjnLPbd199o/edit?usp=drive_web>  
Message 14 from the Guest saying Hey Breann and Daisy,   Thanks for getting back to us! We saw that the price on the contract is $10,000 but we were told while we were visiting the venue that the price was $8,000. Can we get this fixed before we sign?  Also we briefly touched upon splitting the payment into installments, how do we set that up? We are happy to do half now and half in a month or something like that.   Thanks  Sierra and Ethan
Message 15 from the Events Team saying Hi Sierra and Ethan, Oops, sorry about that. Good catch! I went ahead and adjusted the contract to reflect $8000 for your  5.3.25 buyout and changed the invoice to $4,000 due in 30 days. We'll touch base about the balance towards the end of summer. Thank you! Breann  
Message 16 from the Guest saying Hi Breann,  Thank you for sending that over! We paid the $4000 invoice and initialed the contract. Please let us know if we missed anything on the contract.   Is there a specific link our guests can use to reserve their rooms, we anticipate some will stay for more than just the one night.   Please let us know when you can and thanks for all your help! Sierra and Ethan 
Message 17 from the Guest saying Hey Breann!  I hope all is well, I just wanted to ask about how to reserve the rooms that are blocked off for our wedding weekend. Is there a link people should use to block off the days or do they need to call directly?  Thanks, Sierra Ward
Message 18 from the Events Team saying Hi Sierra, Your booking group code is : b190234  and the booking link below will take your guests directly to our website's booking page. A note: it will say that nothing is available until you add the dates at the top of the page. *https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04 <https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04>*  I cc'd mine and Daisy's direct emails so there's no more delay in our response.  One more note: if you have any questions about your lodging or if you're having trouble with the booking code, please contact Gabe, our Inn manager, at 831-667-2700.  Have a great weekend! Thank you!  Breann  
Message 19 from the Guest saying  Hi Breann and Daisy,  I hope you are doing well! We just wanted to touch base, to see if there’s anything else we should be doing with you two to prepare for the wedding.  Als if we can get a rough timeline on the day of that would be greatly appreciated!  Quick question do we need to get vendors approved by you? We are looking into our photographers and florist right now!  Thanks  Sierra and Ethan
Message 20 from the Events Team saying Thanks for emailing, Sierra. Daisy will be back tomorrow.  No need to get vendors approved. Just let us know when you hire them and we will add the info to your contract. Please don't hesitate to send them our contact info if they have questions regarding the layout or terms or anything at all.  A rough timeline of your day: 30 min - guest arrival 30 min. - Ceremony 90 min. - Photos and Cocktail Hour 60 min. - Dinner, Speeches? 90 min - Free Time  Hope this helps!Have a great day! Breann   
Message 21 from the Events Team saying Hi Sierra! I wanted to follow up on my last email. Would you be interested in having a phone chat soon? I realized you may not have gotten proper onboarding and I want to make sure you're feeling good and know what the next steps are. I'm flexible. Let me know! Have a great day! Breann  *I added my direct email for faster response time  
Message 22 from the Guest saying Hi Breann and Daisy  Thanks for emailing us back! We would love to have a chat soon about the nexts steps. Are you available anytime after 10 this Thursday?  Thanks,  Ethan and Sierra
Conversation 3 made up of 
Message 1 from the Guest saying Hi, Big Sur River Inn!  Can you share more information on hosting a wedding on site? I'm specifically curious how many people can attend?  Thank you!  *--*  *Jennifer L. Schmit* 
Message 2 from the Events Team saying Hi Jennifer, Thanks for your email. We can accommodate up to 250 guests for a private event. I've attached our available packages. Would love to hear more details.  Have a great weekend! Breann  B) Event Packages 2024-2026 <https://docs.google.com/document/d/1cAjx42H8Kqn-GNWWLpjulTdMO81nKrwxxDuWCaQy9qU/edit?usp=drive_web>   June/July 2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>  
Message 3 from the Guest saying Thank you!  Could you share pricing for a ceremony on the lawn?  *--*  *Jennifer L. Schmit*   
Message 4 from the Events Team saying Thank you for your email. Our venue rentals start at $10,000 on weekends, peak season. If you can provide more details, I can give you an accurate quote. Are you interested in a reception or just a ceremony?  Have a great day!  
Message 5 from the Events Team saying Hi Jenny, I hope you are having a great weekend so far. We updated our brochure and photos so I thought I'd send them over. Hope wedding planning is going well!  Please don't hesitate to reach out if you have any questions regarding River Inn or Big Sur in general.  Sincerely, Breann    weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>  

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hi Breann!  Unfortunately we've decided to go a different way. Thank you so much for the brochure! Good luck to you!  Thank you, Valerie and Cas  

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hi there, My name is Jasmin and I'm working with a prospective couple looking to explore options for wedding venues for next September. They love what the Big Sur River Inn has to offer for their special day which is why I'm reaching out! I wanted to provide a bit more context on what we're looking for and then schedule a call for us to connect in the next week or so. Would you send me a couple of times when you're available to connect, please? We're looking for our dream venue to have the following:     - Availability the weekend of 9/12-9/14 with the wedding ceremony taking    place on 9/14 from 10 am - 3/4 PM    - A ceremony and reception space that accommodates 150-175 individuals    - Options for catering either with provided onsite service or external    vendors for Friday night dinner, Saturday breakfast, lunch, and dinner, and    then meals on Sunday as well    - 50-60 units onsite or nearby to accommodate guests  We're excited to connect with you all and see what might be possible given the couples' vision for their wedding! I look forward to hearing from you soon!  Warmly, Jasmin 
Message 2 from the Events Team saying Jasmin, Hello and thank you for your email. Unfortunately, we are already booked for that weekend. This sounds like such a lovely weekend! Holly Farm (Carmel Valley) and Point 16 (Big Sur) may be able to accommodate you. I can connect you with Point 16's Event Manager if that helps. Good luck in your search!  Sincerely, Breann  
Message 3 from the Guest saying Hi there and thank you for getting back to me! Yes, please connect me with the manager. An introduction would be greatly appreciated.  Warmly, Jasmin  
Message 4 from the Guest saying Hi Breann,  I hope you're having a great week so far! I wanted to reach back out because the scope of our wedding weekend has changed.  We have a venue for Friday/Saturday events and are currently looking for a ceremony space for Sunday morning through 3 PM on 9/14. Would you all happen to have space for that Sunday morning/afternoon for 150 people?  We're contracting with Big Sur Lodge for the first part of the weekend but need a nice and big space for a ceremony and celebration that Sunday.  Look forward to hearing from you!  Warmly, jas  
Message 5 from the Events Team saying Hi Jas! That might work! Let me check on a few things and get back to you in the next couple of days.  Would you be able to hop on a call?  Thanks! Breann  
Message 6 from the Guest saying Hi there,  Absolutely. When are you free for a chat? You can always text me tomorrow to see if I'm available. 8605979305.  Warmly, Jas  
Message 7 from the Guest saying Before we connect, could you send me your wedding package brochures please so that I can review before we connect?  Thank you!  Warmly, Jas  
Conversation 2 made up of 
Conversation 3 made up of 
Message 1 from the Guest saying Hello Big Sur River Inn team -  My name is Lia and I assist Lorenzo Fertitta and family here in Las Vegas. The Fertittas are coming to town later this year and are looking to host a dinner for max 40 guests on the evening of Friday, Nov. 8th. We are inquiring as to whether or not the Inn would have dinner space for them? Please let me know what you think. I’m available on cell as well if you’re able to discuss. Thank you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    
Message 2 from the Events Team saying Hi Lia, Thanks for reaching out. We would love to accommodate Mr. Fertitta for dinner on November 8. We have indoor and outdoor private dining options. I will have Breann, our Events Director, give you a call when she gets in tomorrow if that's ok with you.  I cc'd her on this email as well. Have a great day!   
Message 3 from the Guest saying Wonderful news - thank you so much.  Breann - I’m available via cell or email at your convenience. I look forward to hearing from you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 4, 2024, at 3:00 PM, Events Team <events@bigsurriverinn.com> wrote:  Hi Lia, Thanks for reaching out. We would love to accommodate Mr. Fertitta for dinner on November 8. We have indoor and outdoor private dining options. I will have Breann, our Events Director, give you a call when she gets in tomorrow if that's ok with you.  I cc'd her on this email as well. Have a great day!   
Message 4 from the Guest saying Hi Lia, Hope you are doing well today! We are excited that Mr. Fertitta is coming to visit Big Sur. What a change of pace from Vegas.  I have multiple options for you...I'll be able to guide you toward the most suitable space and menu once I hear a few more details. Can I call you this afternoon?  Looking forward to connecting!  Breann  It's a beautiful day at River Inn! Check out our LIVE CAME HERE :)     
Message 5 from the Guest saying Hi Breann - I’m available when you are. Thank you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 6, 2024, at 10:16 AM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Hope you are doing well today! We are excited that Mr. Fertitta is coming to visit Big Sur. What a change of pace from Vegas.  I have multiple options for you...I'll be able to guide you toward the most suitable space and menu once I hear a few more details. Can I call you this afternoon?  Looking forward to connecting!  Breann  It's a beautiful day at River Inn! Check out our LIVE CAME HERE :)<x-msg://123/It's%20a%20beautiful%20day%20at%20River%20Inn!%20Check%20out%20our%20LIVE%20CAME%20HERE%20:)>  [https://ci3.googleusercontent.com/mail-sig/AIorK4zkbjDTQ88A3AQx3Wt8rprkk68Hl1lG2DOdKxG47kUSYtKP8qRqX4_DM3mRm5wMv12rH0yOk6dzHo6Z]   
Message 6 from the Guest saying Breann - my apologies that I missed calling you back yesterday afternoon - the day got away from me. By chance are you available at any time today?  Thanks!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 6, 2024, at 10:16 AM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Hope you are doing well today! We are excited that Mr. Fertitta is coming to visit Big Sur. What a change of pace from Vegas.  I have multiple options for you...I'll be able to guide you toward the most suitable space and menu once I hear a few more details. Can I call you this afternoon?  Looking forward to connecting!  Breann  It's a beautiful day at River Inn! Check out our LIVE CAME HERE :)<x-msg://148/It's%20a%20beautiful%20day%20at%20River%20Inn!%20Check%20out%20our%20LIVE%20CAME%20HERE%20:)>  [https://ci3.googleusercontent.com/mail-sig/AIorK4zkbjDTQ88A3AQx3Wt8rprkk68Hl1lG2DOdKxG47kUSYtKP8qRqX4_DM3mRm5wMv12rH0yOk6dzHo6Z]   
Message 7 from the Guest saying Hi Lia, Sorry we missed each other! I am running around this weekend with events...can we connect on Monday? Anytime. Hope you're having a great weekend!  Breann  
Message 8 from the Guest saying Hello Breann - I’m back in the office today if you have any time to talk. Thank you   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com   On Jun 8, 2024, at 2:31 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Sorry we missed each other! I am running around this weekend with events...can we connect on Monday? Anytime. Hope you're having a great weekend!  Breann  
Message 9 from the Guest saying Nice speaking with you, Lia, Below are pictures of the indoor/outdoor space I think would work for the Rehearsal Dinner. You could host cocktail hour on the patio and move inside for dinner. If utilizing both spaces is unnecessary, I will keep an eye on the weather, then set the party up where guests will be most comfortable. I will give you pricing for both scenarios.  Let me know if you have any questions. Thank you! Breann   For Lia <https://drive.google.com/drive/folders/1GD6UFSSQ2Sb4DwnK5bhRDcxiwIFlpRu->    Catering Menu 2025 <https://docs.google.com/document/d/1O0NBvYjy_39b8XVR1_9p7JRBBvB66FAFXuZyP-GlDtI/edit?usp=drive_web>    
Message 10 from the Guest saying Breann - a very late THANK YOU for putting this all together. It’s been a whirlwind first summer month and the Fertittas really didn’t give this party too much attention. BUT we’re back in action and I should have some answers this upcoming week.  Confirming you still have some space available on that Friday, November 8th date? Thanks so much!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 12, 2024, at 2:38 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Nice speaking with you, Lia, Below are pictures of the indoor/outdoor space I think would work for the Rehearsal Dinner. You could host cocktail hour on the patio and move inside for dinner. If utilizing both spaces is unnecessary, I will keep an eye on the weather, then set the party up where guests will be most comfortable. I will give you pricing for both scenarios.  Let me know if you have any questions. Thank you! Breann  [https://drive-thirdparty.googleusercontent.com/16/type/application/vnd.google-apps.folder] For Lia<https://drive.google.com/drive/folders/1GD6UFSSQ2Sb4DwnK5bhRDcxiwIFlpRu->   [https://drive-thirdparty.googleusercontent.com/16/type/application/vnd.google-apps.document] Catering Menu 2025<https://docs.google.com/document/d/1O0NBvYjy_39b8XVR1_9p7JRBBvB66FAFXuZyP-GlDtI/edit?usp=drive_web>    
Message 11 from the Guest saying Hi Lia, My pleasure! Great to hear from you. We absolutely have room and would love to have the Fertitta's. Breann  
Message 12 from the Guest saying Thanks so much! I’ll be in touch soon   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jul 16, 2024, at 4:58 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, My pleasure! Great to hear from you. We absolutely have room and would love to have the Fertitta's. Breann  
Message 13 from the Guest saying Hello Breann - Happy to report that the Fertittas would like to host their dinner at your Inn on Friday, Nov. 8th 🎉 The family and I so very much appreciate your flexibility and positivity/willingness to help us with this evening!  What information do you need from us to get started? Guest count is still being confirmed on our side but last we checked we were roughly 40 people or so. My guess is they will want to dine inside (I believe you and I had chatted about a covered/enclosed patio area that you thought was best)?  Happy to get on another call whenever you deem appropriate (now or closer to the date). Thank you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jul 16, 2024, at 4:58 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, My pleasure! Great to hear from you. We absolutely have room and would love to have the Fertitta's. Breann  
Message 14 from the Guest saying Hello Lia Wonderful news! I don't need much more information yet. I'll send over a proposal and menus this week. Food/beverage and final guest will be due 30 days prior to the event. Let me know if you have any other questions for now.  Looking forward to having the Fertittas!  Breann  
Message 15 from the Guest saying Thank you so much 🎉   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jul 31, 2024, at 1:10 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hello Lia Wonderful news! I don't need much more information yet. I'll send over a proposal and menus this week. Food/beverage and final guest will be due 30 days prior to the event. Let me know if you have any other questions for now.  Looking forward to having the Fertittas!  Breann  
Message 16 from the Guest saying Hi Breann -  Hope you had a lovely rest of your summer and are looking forward to some cooler weather!  Teresa Fertitta asked that I reach out as she’s anxious to get the party sorted for November… early, I know.  Is there a way that we can start to put together a menu/plan for her review?  We are still hovering around the 40 guest count number… refined numbers closer to the date of course. Not sure if you handle it all a la carte, or if we could have some set appetizers, salads and maybe a small option of entree? (Choice of beef, chicken, fish, vegetarian sorta thing)…  Let me know your thoughts. Happy to get on the phone if easier to start planning. Thank you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com   On Jul 31, 2024, at 1:10 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hello Lia Wonderful news! I don't need much more information yet. I'll send over a proposal and menus this week. Food/beverage and final guest will be due 30 days prior to the event. Let me know if you have any other questions for now.  Looking forward to having the Fertittas!  Breann  

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Great! I would be interested in all 22 rooms. I don't think we need exclusive use in terms of the restaurant but I would like to roll meals into the invoice for my group.  Let me know what other details you need to produce a quote. Thank you!  

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Greetings- I am looking at wedding venues and your inn looks beautiful.  Are you able to send more details including how many guests you accommodate?  Best, Briana Okyere 
Message 2 from the Events Team saying Hello!  Thank you for considering Big Sur River Inn for your wedding venue! We have the capacity to host up to 250 guests per event and up to 65 guests in our hotel.  What month/season were you thinking?  Looking forward to hearing more!  Sincerely, River Inn Events Team   
Conversation 2 made up of 
Message 1 from the Guest saying Hello all,  My partner Yurij and I are getting married in late spring/early summer 2026. We live in Berkeley and love Big Sur -- we can't think of a more beautiful place to get married, and your inn looks so lovely.  I'd like to know more about your wedding packages -- prices for renting the venue, whether the catering and/bar would be through you all or us bringing outside vendors, and what the accommodation situation would look like (how many rooms could our guests rent, how much per night, etc.).  Thank you!! Alice Kassinger 
Message 2 from the Events Team saying Thank you for considering us for your wedding venue! We specialize in hosting unforgettable wedding weekends, from the Rehearsal Dinner to the Post-Wedding Breakfast.  We are currently offering the following package for Friday-Sundays, year round:  **Wedding Ceremony and Reception Package**  - Minimum of 75 guests, up to 250  - In-House Full-Wedding Planning  - Ceremony on the Lawn overlooking the Big Sur River  - 2 Patios for your reception  - Champagne Toast  - On-site Catering and Signature Crafted Cocktails  - Menu Tasting with Wine Pairing  - Dinner with Cocktail Hour and Dessert  - Private Outdoor Tiki Bar and Pool  - Indoor Dance Floor  - Full Property Venue rental starting at $10,000  -Lodging on property - 8 Riverside Suites and 14 guest rooms $345-$515 (overflow lodging nearby)  Consider adding these events for an epic Wedding Weekend:  - Welcome Cocktail Party  - Rehearsal Dinner  - Post-Wedding Brunch  - Post-Wedding Pool Party   How many guests were you planning on inviting?  Looking forward to hearing more!    weddings 2024 <https://drive.google.com/open?id=1mQsfnWom17idqD1QzYySwKVI98-qoSeT>    
Message 3 from the Guest saying Thank you, all! I loved those pictures, the place looks absolutely beautiful.  We're planning on having about 120 guests, and we'd plan on doing a full property buy-out (our guests could hopefully rent the rooms directly through you, though). Would that be the $10k quoted in the list above? (Separate from catering and bar packages of course).  I noticed you described the bar options only under the brunch menu -- do you also offer bar packages for the reception alongside your catering menu? If so, are they the same options for the brunch as for the reception dinner bar? And do you all also charge a service fee?  Thank you so much! We're just getting started, so still figuring out the right questions to ask :) Alice  
Message 4 from the Guest saying And so sorry for the quick follow-up -- I know you said 8 suites and 14 guest rooms. Can you clarify, how many total individuals would that be?  
Message 5 from the Events Team saying Hi! So sorry! You were so quick, I accidentally skipped right over this. eek! To answer your question, capacity depends on your guests. Are they mostly couples or families? Below is a rooming list with capacity that helps during the planning process.  Have a great evening!  
Conversation 3 made up of 
Message 1 from the Guest saying Hello, We’re looking into doing a micro wedding almost an elopement. We would have a very small ceremony and then a dinner for about 17 people (including us) and 8 children (ages 1 - 12). We would stay at the property and need approximately 7 rooms. Could you send a pricing list of what you can offer at your property?   Sent from Yahoo Mail for iPhone 
Message 2 from the Events Team saying Hello! Thank you for your email. Have you decided on a date or time of year? Our prices fluctuate seasonally.  Looking forward to hearing more details!   

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hi,  Thank you for reaching out, we ended up finding an alternative venue.  Emma Arago and Jackson Boulter   

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Events Team saying Hi Nikki,  Thank you for your email. We would love to be a part of your boho casual wedding! I've included general pricing for a private wedding/property buyout and a few photos. We have a huge "backyard" on the Big Sur River that would be perfect. Please let us know if you have any questions. Looking forward to hearing more details!  Available Fridays: 6/6/25 6/13/25 6/28/25 8/9/25 8/16/25  Site Fees: 10K+, 5-6 hours Food and Beverage: $125/person +taxes and service charges   June/July 2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>      --  Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :) <https://www.bigsurriverinn.com/weather-and-live-camera> 
Message 2 from the Guest saying Thank you so much for getting back to me!! I was wondering what the site fee includes? Are you able to have the dinner or dancing on the lawn? Can you have a DJ/ what time does the music have to be turned lower? Do you have wine, beer and liquor? Thank you so much! We are trying to make a trip up this weekend to come check out some venues and would love to look around at the River Inn. Thank you again. Nikki Cory  
Message 3 from the Events Team saying This weekend would be ideal! We have a weekend buyout starting Friday evening. You are welcome to come by anytime! It would be good to see how amazing the transformation from restaurant to wedding venue is.  The site fee covers the cost of lost revenue from closing the restaurant to the public. It allows you a private space to create your vision. Yes, DJs are allowed and encouraged! Dancing on the lawn is ok until 8pm, then we switch to an indoor bar and dance floor, where we can party until midnight. Music needs to be turned down at 10pm inside but we've been able to go a little later by keeping to a certain decibel level. There is also The Village, right next door, that can accommodate an after-party. It's a very dark, sultry speakeasy vibe over there.  We do have beer, wine and cocktail packages based on your budget. We have an indoor bar and an outdoor Tiki Bar near the river.  Hope to see you soon! Breann      
Message 4 from the Guest saying Hey!, Just wondering if you had more information or pricing and what all is included? We are definitely considering the river inn just want to see what all is included in the pricing. Thank you!!  Nikki Cory  
Message 5 from the Guest saying Hey, One other question, I saw you listed some dates and said these are the Fridays available but 8/9 and 8/16 are both saturdays. Just wondering if you could give me the available Fridays in July and August of next year? Also is it cheaper to do a Thursday wedding? Do you have any Thursdays available? Do you require we rent out your hotel? Sorry for all the questions, I appreciate your help. Thank you!!  Nikki Cory  
Message 6 from the Guest saying Hey, I was just checking in to see if you received my last 2 emails. I know you are probably very busy, we just wanted to get more info so that we can book a venue soon. Thank you!  Nikki Cory  
Message 7 from the Events Team saying Hi Nikki, Thank you for your incredible patience! To answer your questions:  Fridays available at $10,000, Thursdays available for $8000-$8500 (includes rental of the space for 5 hours, after 5pm) Food/beverages/incidentals all separate. We do provide tables, serveware, dishes, glassware and flatware (chairs need to be rented). We do require that all 22-guest rooms be booked for your party for the night of the event. -Thursday, July 10, 2025 -Friday, July 11, 2025 -Thursday, August 7, 2025 -Friday, August 8, 2025 -Thursday, August 14, 2025 -Friday, August 15, 2025  Hope this helps! Would a phone call be easier?  Have a great night.  Breann     
Conversation 2 made up of 
Message 1 from the Guest saying Hi there,  Me and my partner (David Klech) are interested in your venue for an elopement with our parents 3/19/2025 (the date is flexible, but preferably during this week.).  We've spent many dates and memories in the Big Sur area, and would love to get married there.  Let us know if you have any availability and next steps.  Thanks, David Klech & Kristin Southard 
Message 2 from the Events Team saying Hi Kristin and David, We would love to be a part of your day. Wednesday, March 19, 2025 is available. I will get back to you on pricing. Weather is something to consider. That can be a rainy time.  I will reach back out with more information!  Sincerely, Breann  
Message 3 from the Guest saying Hi Breann,  Hope all is well and thank you for getting back to us! Just wanted to check in, do you have any more details on pricing that we could review? We are excited to hear a bit more about the venue and what options there may be for us with the smaller group of people in one of our favorite places!  Thank you, Krisitn & David  
Message 4 from the Events Team saying Hi David and Kristin, I have a special elopement option that would be perfect for you, I think. I don't have exact costs but it's somewhere around $2500 (based on four guests), after taxes and service charges. And we can add any additional rooms needed.   “The Perfect Day” Elopement: Ceremony on the Lawn overlooking the Big Sur River, up to 10 guests. Includes chairs Professional Officiant Champagne Toast 4- course Dinner for 4 guests Chocolate Covered Strawberries and bottle of wine or Champagne in your suite One night in a Honeymoon Suite, riverside (1 suite included)  **A local florist is available to create a bouquet and boutonniere. River Inn can facilitate that for you, as well as any other amenities, such as live music at the ceremony.  Let me know what you think!  Sincerely, Breann  
Message 5 from the Guest saying Hi Breann,  Thank you for all the information.  Your "The Perfect Day" Elopement package looks AMAZING.   It'd be great to jump on a call or video call soon, (we actually may drive down to Big Sur on Saturday just to check out via a drive by).  I may also be jumping the gun, (but do you have any availability that Saturday (3/22/2025) for a separate reception?  Thank you, David & Kristin  
Message 6 from the Events Team saying We do have that Saturday available as well. We would definitely need to talk about a contingency plan in case of rainy weather.  I am available Saturday if you'd like to come check it out with me, or you can come anytime to sneak a peek :)  As for a call, how about tomorrow? Or if you're coming down, we can chat then.  Thank you! Breann  
Message 7 from the Guest saying Hi Breann,  Thanks for the quick response.  That's awesome to hear that you're available on that date.  Our plan is to come out on Saturday if you have any availability in the afternoon (David has to work in the morning in Santa Cruz but we could be out there around 2:30PM if that works for you, we can potentially try and move things around if needed.)  Thanks, Kristin & David  
Message 8 from the Events Team saying Hi Kristin and David, That seems fine! Let's set up a consult call at your convenience. We'll work out the logistics and I can answer any questions you might have, as well as go over pricing.  Looking forward to working with you both! Let's hop over to my direct email: breann@bigsurriverinn.com. Thank you!  Sincerely, Breann  
Conversation 3 made up of 
Message 1 from the Guest saying Hello and good morning. I've recently gotten engaged and I've been looking at venues. I have come across your beautiful venue. I would love to learn more in a brochure you might have.   Is your space available for mid week? Like a Thursday, for about 175 guests max. Thank you.  Sent from my iPhone
Message 2 from the Events Team saying Good morning and thanks for your email! We are in the process of updating our brochure but here's some information to get you started.  We love weekday weddings! You can reserve the entire property from the Welcome Party to the Post-wedding breakfast.  Looking forward to hearing more details. Have a great day!     June/July 2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>   
Message 3 from the Guest saying Thank you for that. If we would interested in the Wedding Ceremony and Reception for a mid week day for around 175 what might that estimated price be? Sent from my iPhoneOn Sep 9, 2024, at 7:45 AM, Events Team <events@bigsurriverinn.com> wrote:﻿Good morning and thanks for your email! We are in the process of updating our brochure but here's some information to get you started. We love weekday weddings! You can reserve the entire property from the Welcome Party to the Post-wedding breakfast. Looking forward to hearing more details. Have a great day! June/July 2024 Reference Photos
Message 4 from the Events Team saying For 175 guests, mid-week:  COST BREAKDOWN HERE <https://docs.google.com/spreadsheets/d/1N2TTn0PyDUoKCs8IUkohDmjHkbbL5fypqvaVWt9QQz4/edit?gid=1924295023#gid=1924295023>  I hope this helps. It's a transparent breakdown, including taxes and service charges.  CATERING MENU <https://docs.google.com/document/d/10sgqbUlJEvk3U05Z6cduTZrjtxdimlZvZN8S00dcnMo/edit> BAR MENU <https://docs.google.com/document/d/1QLVij8ayJV-Q2GB6uwsOitH-ins2IKBG9vYetKQE7jI/edit>  Any questions, please reach out!  Breann   

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hi there!We are interested! Could you share more information about your availability for august 15 and 16 2025?Also, cost for reserving would be great!Thanks,Emma Sent from my iPhoneOn Nov 1, 2024, at 5:50 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Emma!Thank you for your email. We do offer room blocks for events. If you're interested, please let me know. Otherwise, you are welcome to list River Inn as a lodging option. There is also Big Sur Lodge, which has 100+ rooms. Please let us know if we can be of further assistance. Have a great night!-- Events Team46800 Hwy 1, Big Sur, CA 93920Check out our Big Sur River Inn live cam :)


Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Good afternoon,  We are looking to potentially have an elopement with about 20 guests between January and February 2025. What are some options for us at Big Sur River Inn? Looking forward to hear back.  Oscar
Message 2 from the Events Team saying Hi Oscar, Are you interested in the ceremony only or dinner afterwards as well?  Looking forward to hearing more about your elopement!  
Conversation 2 made up of 
Conversation 3 made up of 
Message 1 from the Guest saying Hello Big Sur River inn events coordinator,   My name is Sierra and I was wondering if I could get more information on your venue. My fiancé Ethan and I have driven by many times and think your hotel is beautiful! We are planning to have about 100 people at our wedding and wanted to have a ceremony looking out at the river. We would like to get married in may or august of 2025. We were wondering what pricing was like for the venue as well as pricing for a reception at your restaurant. Also we saw that for parties you can do wedding cakes/ rental equipment/ photography and were wondering if you had any more information about that.   Thank you for your time,  Sierra and Ethan (702) 539-8747 Wardsm16@gmail.com
Message 2 from the Events Team saying Hello Sierra and Ethan, Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season.  Some of our offerings include, but not limited to: Event space for up to 250 guests A ceremony on the lawn overlooking the Big Sur River Exclusive use of our outdoor patios Market Lights and heaters Set-up and breakdown of tables and chairs Provision of linens, basic flatware, silverware, and glassware In-house Catering, custom menu planning Event planning assistance and day of Venue Coordinator A PA system for speeches, including a microphone with stand Access to our private River bar 22 guest rooms on property Heated Swimming Pool  For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  Looking forward to hearing more about your event!  Breann   
Message 3 from the Guest saying Hello Breann,  Thank you for getting back to us! We were wondering if we could schedule a call to discuss the wedding in further detail. Also we were wondering if we could schedule a tour. We are going to be in Big Sur in June on the 7th and 8th!  Thanks  Ethan and Sierra  > On May 15, 2024, at 1:57 PM, Events Team <events@bigsurriverinn.com> wrote: >  > Hello Sierra and Ethan, > Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  >  > We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season. >  > Some of our offerings include, but not limited to: > Event space for up to 250 guests > A ceremony on the lawn overlooking the Big Sur River > Exclusive use of our outdoor patios > Market Lights and heaters > Set-up and breakdown of tables and chairs > Provision of linens, basic flatware, silverware, and glassware > In-house Catering, custom menu planning > Event planning assistance and day of Venue Coordinator > A PA system for speeches, including a microphone with stand > Access to our private River bar > 22 guest rooms on property > Heated Swimming Pool >  > For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  >  > Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  >  > I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  >  > Looking forward to hearing more about your event! >  > Breann >  >  > 
Message 4 from the Events Team saying Great! Both of those dates work for me. In the meantime, a call would be awesome. Anytime this weekend or next week work for me.  Looking forward to connecting!  Breann  
Message 5 from the Events Team saying Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)  Breann cell: 831-333-6774  
Message 6 from the Guest saying Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 7 from the Guest saying Hey Breann! Hope you are doing well. We are super excited after our last conversation on the way home! We wanted to make sure we did not miss your message in case you did send over the contract? Let us know if there is anything we can do to help! Thanks! Ethan & Sierra On Jun 9, 2024, at 8:30 AM, Sierra Ward <wardsm16@gmail.com> wrote:﻿Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 8 from the Events Team saying Hi Ethan and Sierra! Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience! I did put your room block in place and your date on the books :)  Breann  
Message 9 from the Guest saying Hey Breann! Sounds great thank you! Sierra and Ethan On Jun 12, 2024, at 8:27 AM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Ethan and Sierra!Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience!I did put your room block in place and your date on the books :)Breann
Message 10 from the Guest saying Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan
Message 11 from the Events Team saying Hi! Let me know when you're available to do the invoice for Ethan and Sierra. Thanks! B  ---------- Forwarded message --------- From: Sierra Ward <wardsm16@gmail.com> Date: Mon, Jun 24, 2024, 10:46 AM Subject: Re: Wedding inquiry To: Events Team <events@bigsurriverinn.com>   Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan 
Message 12 from the Guest saying Hi Im in the office today until 2:30. Will you be in or should we schedule a call?  
Message 13 from the Events Team saying Hi Sierra,  Thank you for your patience!  Your contract is ready to go! I just emailed your invoice and your contract is attached. Please e sign when you're ready. After this, we can schedule a tasting as soon as our busy season is over.  Thank you   5.03.25 Croy/Ward wedding <https://docs.google.com/spreadsheets/d/1j4ttvQMURqXVfxSnWBwvSNGMnFvxHBrksjnLPbd199o/edit?usp=drive_web>  
Message 14 from the Guest saying Hey Breann and Daisy,   Thanks for getting back to us! We saw that the price on the contract is $10,000 but we were told while we were visiting the venue that the price was $8,000. Can we get this fixed before we sign?  Also we briefly touched upon splitting the payment into installments, how do we set that up? We are happy to do half now and half in a month or something like that.   Thanks  Sierra and Ethan
Message 15 from the Events Team saying Hi Sierra and Ethan, Oops, sorry about that. Good catch! I went ahead and adjusted the contract to reflect $8000 for your  5.3.25 buyout and changed the invoice to $4,000 due in 30 days. We'll touch base about the balance towards the end of summer. Thank you! Breann  
Message 16 from the Guest saying Hi Breann,  Thank you for sending that over! We paid the $4000 invoice and initialed the contract. Please let us know if we missed anything on the contract.   Is there a specific link our guests can use to reserve their rooms, we anticipate some will stay for more than just the one night.   Please let us know when you can and thanks for all your help! Sierra and Ethan 
Message 17 from the Guest saying Hey Breann!  I hope all is well, I just wanted to ask about how to reserve the rooms that are blocked off for our wedding weekend. Is there a link people should use to block off the days or do they need to call directly?  Thanks, Sierra Ward
Message 18 from the Events Team saying Hi Sierra, Your booking group code is : b190234  and the booking link below will take your guests directly to our website's booking page. A note: it will say that nothing is available until you add the dates at the top of the page. *https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04 <https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04>*  I cc'd mine and Daisy's direct emails so there's no more delay in our response.  One more note: if you have any questions about your lodging or if you're having trouble with the booking code, please contact Gabe, our Inn manager, at 831-667-2700.  Have a great weekend! Thank you!  Breann  
Message 19 from the Guest saying  Hi Breann and Daisy,  I hope you are doing well! We just wanted to touch base, to see if there’s anything else we should be doing with you two to prepare for the wedding.  Als if we can get a rough timeline on the day of that would be greatly appreciated!  Quick question do we need to get vendors approved by you? We are looking into our photographers and florist right now!  Thanks  Sierra and Ethan
Message 20 from the Events Team saying Thanks for emailing, Sierra. Daisy will be back tomorrow.  No need to get vendors approved. Just let us know when you hire them and we will add the info to your contract. Please don't hesitate to send them our contact info if they have questions regarding the layout or terms or anything at all.  A rough timeline of your day: 30 min - guest arrival 30 min. - Ceremony 90 min. - Photos and Cocktail Hour 60 min. - Dinner, Speeches? 90 min - Free Time  Hope this helps!Have a great day! Breann   
Message 21 from the Events Team saying Hi Sierra! I wanted to follow up on my last email. Would you be interested in having a phone chat soon? I realized you may not have gotten proper onboarding and I want to make sure you're feeling good and know what the next steps are. I'm flexible. Let me know! Have a great day! Breann  *I added my direct email for faster response time  
Message 22 from the Guest saying Hi Breann and Daisy  Thanks for emailing us back! We would love to have a chat soon about the nexts steps. Are you available anytime after 10 this Thursday?  Thanks,  Ethan and Sierra

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hello!  We sent a wedding inquiry through your website last month but haven't heard back. Would it be possible to schedule a call to discuss potentially having our wedding at the Big Sur River Inn next year?  Thanks so much!  Best, Michael and Zahara 

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hello Big Sur River inn events coordinator,   My name is Sierra and I was wondering if I could get more information on your venue. My fiancé Ethan and I have driven by many times and think your hotel is beautiful! We are planning to have about 100 people at our wedding and wanted to have a ceremony looking out at the river. We would like to get married in may or august of 2025. We were wondering what pricing was like for the venue as well as pricing for a reception at your restaurant. Also we saw that for parties you can do wedding cakes/ rental equipment/ photography and were wondering if you had any more information about that.   Thank you for your time,  Sierra and Ethan (702) 539-8747 Wardsm16@gmail.com
Message 2 from the Events Team saying Hello Sierra and Ethan, Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season.  Some of our offerings include, but not limited to: Event space for up to 250 guests A ceremony on the lawn overlooking the Big Sur River Exclusive use of our outdoor patios Market Lights and heaters Set-up and breakdown of tables and chairs Provision of linens, basic flatware, silverware, and glassware In-house Catering, custom menu planning Event planning assistance and day of Venue Coordinator A PA system for speeches, including a microphone with stand Access to our private River bar 22 guest rooms on property Heated Swimming Pool  For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  Looking forward to hearing more about your event!  Breann   
Message 3 from the Guest saying Hello Breann,  Thank you for getting back to us! We were wondering if we could schedule a call to discuss the wedding in further detail. Also we were wondering if we could schedule a tour. We are going to be in Big Sur in June on the 7th and 8th!  Thanks  Ethan and Sierra  > On May 15, 2024, at 1:57 PM, Events Team <events@bigsurriverinn.com> wrote: >  > Hello Sierra and Ethan, > Thank you for your email! We would love an opportunity to help host your wedding. We have event coordinators that can assist you in planning every detail, as well as securing your vendors (flowers, DJ, Rentals, etc.).  >  > We have a lovely lawn overlooking the Big Sur River where your ceremony would be. For a 100 guest - reception, we offer an evening buyout or all-day buyout of the restaurant, lawn/river access and two patios. Check out our catering packet HERE. <https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit> May is considered Off-season and August is Peak-season. >  > Some of our offerings include, but not limited to: > Event space for up to 250 guests > A ceremony on the lawn overlooking the Big Sur River > Exclusive use of our outdoor patios > Market Lights and heaters > Set-up and breakdown of tables and chairs > Provision of linens, basic flatware, silverware, and glassware > In-house Catering, custom menu planning > Event planning assistance and day of Venue Coordinator > A PA system for speeches, including a microphone with stand > Access to our private River bar > 22 guest rooms on property > Heated Swimming Pool >  > For your reception, you can choose from a flexible menu with options for buffet, BBQ, Cocktail Party or Family-Style meals. Bar drinks are charged upon consumption at your reception. A typical catered dinner at River Inn ranges from $65-$85/person. Our menu options with prices are in the catering packet.  >  > Should you choose to book our property as your venue, we can arrange a hotel block, allowing your guests to reserve and pay for their own rooms. Securing a room block will lock in our rates of $345 for a Single Queen, $395 for a Double Queen and $515 for a Riverside Suite, instead of fluctuating.  >  > I included a few pictures so you can get a feel for our vibe <https://drive.google.com/drive/folders/1b12nHdLxGEfRTvqeGFZy0JLkg2SvUVnR>. We are happy to schedule a call to discuss further.  >  > Looking forward to hearing more about your event! >  > Breann >  >  > 
Message 4 from the Events Team saying Great! Both of those dates work for me. In the meantime, a call would be awesome. Anytime this weekend or next week work for me.  Looking forward to connecting!  Breann  
Message 5 from the Events Team saying Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)  Breann cell: 831-333-6774  
Message 6 from the Guest saying Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 7 from the Guest saying Hey Breann! Hope you are doing well. We are super excited after our last conversation on the way home! We wanted to make sure we did not miss your message in case you did send over the contract? Let us know if there is anything we can do to help! Thanks! Ethan & Sierra On Jun 9, 2024, at 8:30 AM, Sierra Ward <wardsm16@gmail.com> wrote:﻿Hi Breann! It was great meeting you yesterday. We really like the venue. We are wondering what it would look like to put a hold on the venue for May 3rd of next year? Thanks!On May 22, 2024, at 2:05 PM, Events Team <events@bigsurriverinn.com> wrote:﻿Great speaking with you and Ethan! I will see you both on June 8 around 2pm. :)Breanncell: 831-333-6774
Message 8 from the Events Team saying Hi Ethan and Sierra! Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience! I did put your room block in place and your date on the books :)  Breann  
Message 9 from the Guest saying Hey Breann! Sounds great thank you! Sierra and Ethan On Jun 12, 2024, at 8:27 AM, Events Team <events@bigsurriverinn.com> wrote:﻿Hi Ethan and Sierra!Good morning! Sorry for the hold-up. I wanted to create your invoice with Daisy and we got a little busy with meetings yesterday. I will send that out today. Thank you for your patience!I did put your room block in place and your date on the books :)Breann
Message 10 from the Guest saying Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan
Message 11 from the Events Team saying Hi! Let me know when you're available to do the invoice for Ethan and Sierra. Thanks! B  ---------- Forwarded message --------- From: Sierra Ward <wardsm16@gmail.com> Date: Mon, Jun 24, 2024, 10:46 AM Subject: Re: Wedding inquiry To: Events Team <events@bigsurriverinn.com>   Hi Breann,  I just wanted to check in to see if the contract was ready yet? We have people who want to book their rooms already. Let us know if there’s anything we can do!  Thanks  Sierra and Ethan 
Message 12 from the Guest saying Hi Im in the office today until 2:30. Will you be in or should we schedule a call?  
Message 13 from the Events Team saying Hi Sierra,  Thank you for your patience!  Your contract is ready to go! I just emailed your invoice and your contract is attached. Please e sign when you're ready. After this, we can schedule a tasting as soon as our busy season is over.  Thank you   5.03.25 Croy/Ward wedding <https://docs.google.com/spreadsheets/d/1j4ttvQMURqXVfxSnWBwvSNGMnFvxHBrksjnLPbd199o/edit?usp=drive_web>  
Message 14 from the Guest saying Hey Breann and Daisy,   Thanks for getting back to us! We saw that the price on the contract is $10,000 but we were told while we were visiting the venue that the price was $8,000. Can we get this fixed before we sign?  Also we briefly touched upon splitting the payment into installments, how do we set that up? We are happy to do half now and half in a month or something like that.   Thanks  Sierra and Ethan
Message 15 from the Events Team saying Hi Sierra and Ethan, Oops, sorry about that. Good catch! I went ahead and adjusted the contract to reflect $8000 for your  5.3.25 buyout and changed the invoice to $4,000 due in 30 days. We'll touch base about the balance towards the end of summer. Thank you! Breann  
Message 16 from the Guest saying Hi Breann,  Thank you for sending that over! We paid the $4000 invoice and initialed the contract. Please let us know if we missed anything on the contract.   Is there a specific link our guests can use to reserve their rooms, we anticipate some will stay for more than just the one night.   Please let us know when you can and thanks for all your help! Sierra and Ethan 
Message 17 from the Guest saying Hey Breann!  I hope all is well, I just wanted to ask about how to reserve the rooms that are blocked off for our wedding weekend. Is there a link people should use to block off the days or do they need to call directly?  Thanks, Sierra Ward
Message 18 from the Events Team saying Hi Sierra, Your booking group code is : b190234  and the booking link below will take your guests directly to our website's booking page. A note: it will say that nothing is available until you add the dates at the top of the page. *https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04 <https://hotels.cloudbeds.com/reservation/aOioe7?allotment_block_code=b190234#checkin=2025-05-02&checkout=2025-05-04>*  I cc'd mine and Daisy's direct emails so there's no more delay in our response.  One more note: if you have any questions about your lodging or if you're having trouble with the booking code, please contact Gabe, our Inn manager, at 831-667-2700.  Have a great weekend! Thank you!  Breann  
Message 19 from the Guest saying  Hi Breann and Daisy,  I hope you are doing well! We just wanted to touch base, to see if there’s anything else we should be doing with you two to prepare for the wedding.  Als if we can get a rough timeline on the day of that would be greatly appreciated!  Quick question do we need to get vendors approved by you? We are looking into our photographers and florist right now!  Thanks  Sierra and Ethan
Message 20 from the Events Team saying Thanks for emailing, Sierra. Daisy will be back tomorrow.  No need to get vendors approved. Just let us know when you hire them and we will add the info to your contract. Please don't hesitate to send them our contact info if they have questions regarding the layout or terms or anything at all.  A rough timeline of your day: 30 min - guest arrival 30 min. - Ceremony 90 min. - Photos and Cocktail Hour 60 min. - Dinner, Speeches? 90 min - Free Time  Hope this helps!Have a great day! Breann   
Message 21 from the Events Team saying Hi Sierra! I wanted to follow up on my last email. Would you be interested in having a phone chat soon? I realized you may not have gotten proper onboarding and I want to make sure you're feeling good and know what the next steps are. I'm flexible. Let me know! Have a great day! Breann  *I added my direct email for faster response time  
Message 22 from the Guest saying Hi Breann and Daisy  Thanks for emailing us back! We would love to have a chat soon about the nexts steps. Are you available anytime after 10 this Thursday?  Thanks,  Ethan and Sierra
Conversation 2 made up of 
Message 1 from the Guest saying Hi there, My name is Jasmin and I'm working with a prospective couple looking to explore options for wedding venues for next September. They love what the Big Sur River Inn has to offer for their special day which is why I'm reaching out! I wanted to provide a bit more context on what we're looking for and then schedule a call for us to connect in the next week or so. Would you send me a couple of times when you're available to connect, please? We're looking for our dream venue to have the following:     - Availability the weekend of 9/12-9/14 with the wedding ceremony taking    place on 9/14 from 10 am - 3/4 PM    - A ceremony and reception space that accommodates 150-175 individuals    - Options for catering either with provided onsite service or external    vendors for Friday night dinner, Saturday breakfast, lunch, and dinner, and    then meals on Sunday as well    - 50-60 units onsite or nearby to accommodate guests  We're excited to connect with you all and see what might be possible given the couples' vision for their wedding! I look forward to hearing from you soon!  Warmly, Jasmin 
Message 2 from the Events Team saying Jasmin, Hello and thank you for your email. Unfortunately, we are already booked for that weekend. This sounds like such a lovely weekend! Holly Farm (Carmel Valley) and Point 16 (Big Sur) may be able to accommodate you. I can connect you with Point 16's Event Manager if that helps. Good luck in your search!  Sincerely, Breann  
Message 3 from the Guest saying Hi there and thank you for getting back to me! Yes, please connect me with the manager. An introduction would be greatly appreciated.  Warmly, Jasmin  
Message 4 from the Guest saying Hi Breann,  I hope you're having a great week so far! I wanted to reach back out because the scope of our wedding weekend has changed.  We have a venue for Friday/Saturday events and are currently looking for a ceremony space for Sunday morning through 3 PM on 9/14. Would you all happen to have space for that Sunday morning/afternoon for 150 people?  We're contracting with Big Sur Lodge for the first part of the weekend but need a nice and big space for a ceremony and celebration that Sunday.  Look forward to hearing from you!  Warmly, jas  
Message 5 from the Events Team saying Hi Jas! That might work! Let me check on a few things and get back to you in the next couple of days.  Would you be able to hop on a call?  Thanks! Breann  
Message 6 from the Guest saying Hi there,  Absolutely. When are you free for a chat? You can always text me tomorrow to see if I'm available. 8605979305.  Warmly, Jas  
Message 7 from the Guest saying Before we connect, could you send me your wedding package brochures please so that I can review before we connect?  Thank you!  Warmly, Jas  
Conversation 3 made up of 

We have received an email from a prospective guest that is interested in a wedding or event at our business, the Big Sur River Inn. They have sent us this email message: 
Hi,  I hope you’re doing well!  Would you be interested in acquiring the National Association of Convenience Stores Attendees Email Lists 2024?  The list includes: company or organization name, first name, last name, full name, contact job title, verified email address, website URL, mailing address, phone number, industry, and many more.  Number of contacts    : 26,798 verified contacts. Cost                              : $1,789  1. Provide me more details that I'm interested in purchasing.. 2. OPT-OUT  Regards,  Kya Liam 

Please help us generate a response to this inquiry with the help of these conversations between a guest and the Events Team as follows: 
Conversation 1 made up of 
Message 1 from the Guest saying Hi,  I hope you’re doing well!  Would you be interested in acquiring the NACS Show Attendee Email List 2024?  List Includes: Company/Org Name, First Name, Last Name, Full Name, Contact Job Title, Verified Email Address, Website URL, Mailing address, Phone number, Industry and many more…  Number of Contacts: 26,763 Verified Contacts Regular Cost: $1,789 Special Discount: $1,589 (Limited-time offer)  If you’re interested please let me know I will assist you with further details.  Kind Regards, Elina Andrew Marketing Coordinator  To unsubscribe kindly reply with "Leave Out" in the subject line. 
Conversation 2 made up of 
Message 1 from the Events Team saying Hi Nikki,  Thank you for your email. We would love to be a part of your boho casual wedding! I've included general pricing for a private wedding/property buyout and a few photos. We have a huge "backyard" on the Big Sur River that would be perfect. Please let us know if you have any questions. Looking forward to hearing more details!  Available Fridays: 6/6/25 6/13/25 6/28/25 8/9/25 8/16/25  Site Fees: 10K+, 5-6 hours Food and Beverage: $125/person +taxes and service charges   June/July 2024 Reference Photos <https://drive.google.com/drive/folders/1wgJVu2KBvdwJxd0n_MHgoaP7VjiQHU-8>      --  Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :) <https://www.bigsurriverinn.com/weather-and-live-camera> 
Message 2 from the Guest saying Thank you so much for getting back to me!! I was wondering what the site fee includes? Are you able to have the dinner or dancing on the lawn? Can you have a DJ/ what time does the music have to be turned lower? Do you have wine, beer and liquor? Thank you so much! We are trying to make a trip up this weekend to come check out some venues and would love to look around at the River Inn. Thank you again. Nikki Cory  
Message 3 from the Events Team saying This weekend would be ideal! We have a weekend buyout starting Friday evening. You are welcome to come by anytime! It would be good to see how amazing the transformation from restaurant to wedding venue is.  The site fee covers the cost of lost revenue from closing the restaurant to the public. It allows you a private space to create your vision. Yes, DJs are allowed and encouraged! Dancing on the lawn is ok until 8pm, then we switch to an indoor bar and dance floor, where we can party until midnight. Music needs to be turned down at 10pm inside but we've been able to go a little later by keeping to a certain decibel level. There is also The Village, right next door, that can accommodate an after-party. It's a very dark, sultry speakeasy vibe over there.  We do have beer, wine and cocktail packages based on your budget. We have an indoor bar and an outdoor Tiki Bar near the river.  Hope to see you soon! Breann      
Message 4 from the Guest saying Hey!, Just wondering if you had more information or pricing and what all is included? We are definitely considering the river inn just want to see what all is included in the pricing. Thank you!!  Nikki Cory  
Message 5 from the Guest saying Hey, One other question, I saw you listed some dates and said these are the Fridays available but 8/9 and 8/16 are both saturdays. Just wondering if you could give me the available Fridays in July and August of next year? Also is it cheaper to do a Thursday wedding? Do you have any Thursdays available? Do you require we rent out your hotel? Sorry for all the questions, I appreciate your help. Thank you!!  Nikki Cory  
Message 6 from the Guest saying Hey, I was just checking in to see if you received my last 2 emails. I know you are probably very busy, we just wanted to get more info so that we can book a venue soon. Thank you!  Nikki Cory  
Message 7 from the Events Team saying Hi Nikki, Thank you for your incredible patience! To answer your questions:  Fridays available at $10,000, Thursdays available for $8000-$8500 (includes rental of the space for 5 hours, after 5pm) Food/beverages/incidentals all separate. We do provide tables, serveware, dishes, glassware and flatware (chairs need to be rented). We do require that all 22-guest rooms be booked for your party for the night of the event. -Thursday, July 10, 2025 -Friday, July 11, 2025 -Thursday, August 7, 2025 -Friday, August 8, 2025 -Thursday, August 14, 2025 -Friday, August 15, 2025  Hope this helps! Would a phone call be easier?  Have a great night.  Breann     
Conversation 3 made up of 
Message 1 from the Guest saying Hi there,  I'm interested in your private events packages and pricing for my wedding next year, can you please forward more information?  Thanks! Ali 
Message 2 from the Events Team saying Hello! We are excited at the prospect of being your wedding venue, Ali. I've attached our current brochure and menu for your review. The following Fridays and Saturdays are available (with corresponding site fees) for next year:  **Event time is 5 hours, 5:00PM - 10:00PM  Fri. July 11, 2025, site fee $9,000  Sat. July 12, 2025, site fee $11,000  Sat. September 6, 2025, site fee $10,000  Fri. September 19, 2025, site fee $8000  Sat. September 20, 2025, site fee $11,000  Fri. September 26, 2025, site fee $7500  Sat. September 27, 2025, site fee $11,000  Fri. October 3, 2025, site fee $8,000  Sat. October 4, 2025, site fee $10,000  Sat. October 18, 2025, site fee $7500   Please let us know if you have any questions. There are more dates available and pricing fluctuates daily so let us know if there is a specific time of year in mind. We are looking forward to hearing more details!  Have a great day :)   

