
new thread with id: 192dfa129b80ddd5
this thread message is as follows
Great! Answers in-line in bold.  I'd also like to have some activities planned/paid for. Do you have pricing or details on the guided tours, tours on e-bike, massages, yoga, art class, etc.. that you mentioned?  Thank you so much for your help so far!  Best,  Zach  
Hi Breann,  We are definitely interested! The photos are absolutely gorgeous. I’ve been to the River Inn several times growing up and it was always a fun and special experience! We’d likely lean towards the Nov 1st since the 8th is booked.  I would love to get a little more information on pricing breakdowns and what is included so we can confirm that this fits into our budget.  Thank you very much! Cas  
Hi Breann,  Hope all is well and thank you for getting back to us! Just wanted to check in, do you have any more details on pricing that we could review? We are excited to hear a bit more about the venue and what options there may be for us with the smaller group of people in one of our favorite places!  Thank you, Krisitn & David  
Thanks Breann and appreciate the helpful tip! Would you be able to provide more info on the package/venue pricing, event spaces, etc?  Thanks! Karam  

new thread with id: 192ea5607d4d4a24
this thread message is as follows
Hi again, Happy Saturday! I think we would only need accommodations for the Friday and Saturday night not the rehearsal dinner/ welcome dinner.  We will likely have some people camping, and do a little gathering at the campsite instead. Our wedding will be on Saturday at Loma Vista. We haven’t sent our invitations yet, and really are not sure how many people would require accommodations yet. Thinking it could be around 20-30 people. If you could send me information about reserving a block for up to 30 people that would be so fantastic. Thank you!EmmaSent from my iPhoneOn Nov 2, 2024, at 1:24 PM, Events Team <events@bigsurriverinn.com> wrote:﻿We do have that weekend available!How many guests are you thinking of inviting? Assuming you would host a rehearsal dinner or welcome party at River Inn and then get married at a different venue on Saturday? 
Hi there!  Thanks for sending all this info!  I love the idea of a wedding weekend from rehearsal dinner to post wedding brunch and pool party!  Our wedding would be for about 125 people. How many people can stay on site and are there other accommodations close by?  What is the curfew of the venue?  Would you be able to send a pricing brochure for the venue rental as well as accommodations?  We would be interested in having food stations with specific food items - is this something your team would be able to accommodate?  Thanks so much! Natalie  
Hi Breann!  September 6th is a great option for us. Any chance you have the last weekend of August open, August 30th for the wedding?  We are looking at 80 guests max for the wedding. Would love to have a quick ceremony on the back lawn area. Do you have chairs or is that something that we would need to rent? Similar question for the reception...I believe that you mentioned having the live edge tables. Do you have chairs available as well?  Could we get some more detailed info about the site fee and what our options are for catering and beverages? I know that you have a bar area out there... We'd maybe want a period of time where we cover beverages and then the remaining time guests are responsible for their own beverages?  Thank you!  Ashley ________________________________ From: Events Team <events@bigsurriverinn.com> Sent: Thursday, October 3, 2024 10:09 AM To: Ashley Wayland <ashley@waylandproperties.co> Subject: Re: Sept 13, 2025 Wedding at the Inn  Hi Ashley We do have September 6, 2025 available!! There will be special pricing for lodging as well. Our motel room prices fluctuate and likely to increase during that time. So we lock in our moderate rates at: Single Queen Rooms at $345 Double Queen Rooms at $395 Riverside Suites at $515 *we do have a suite we save for the bride and groom that doubles as your bridal suite to get ready. We do require that all of our rooms are bought out by wedding guests- there are 22 rooms. It sounds like we may be able to have your whole party stay on property. If we need overflow rooms, there’s a lovely lodge 2 miles south, located in Pfeiffer State Park. I would love to hear more details about your wedding! Have a great day, Breann    Events Team 46800 Hwy 1, Big Sur, CA 93920  Check out our Big Sur River Inn live cam :)<https://urldefense.proofpoint.com/v2/url?u=https-3A__www.bigsurriverinn.com_weather-2Dand-2Dlive-2Dcamera&d=DwMFaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=uRR-G4UH65ZJEZEW1V3p18fB-VFOjLFygWRLuAZ9tts&m=V6cjI1gBZ1BYqa_aEXo6ybWUOxxPr_c5gNk5NhYa9lLTPVRuYKGzQgZ4AGbkOWBi&s=iwYjmU4mVQAuxHMRV8kPGo9Qz6MD6oGRtZlo9mWzRSs&e=> [https://ci3.googleusercontent.com/mail-sig/AIorK4zWa5eqaWwXuo8Hy-AREqvkf5f8kvRYc3dkj8s7ZMnU0fwyWScTvmZ-oetcF_AlDy4jrT2DmrpJcp8r]   
Hello,  I just wanted to follow up on my previous email, I did not receive a response.  Thank you! Kelly  > On Oct 6, 2024, at 7:45 PM, Kelly Bear <kellybear11@yahoo.com> wrote: >  > ﻿ > Hello! > My husband and I had a courthouse ceremony a little over 2 years ago and are now finally planning our wedding ceremony/celebration at the Loma Vista Gardens on 9/26/25. We visited Big Sur in 2023 and ate at your establishment multiple times. We always had a wonderful time; great food and wonderful service. We would love for our family and friends to experience the same! We are planning on having less than 50 guests at our wedding (closer to 30-40) and would love to have our rehearsal dinner at your establishment. Would you happen to have availability for a rehearsal dinner on 9/25/25? Also, do you do room blocks for weddings? > Thank you and we look forward to hearing back from you! 

new thread with id: 1926812e78abcf22
this thread message is as follows
Sounds great. I’m out of the country at the moment. Are you free for a phone call Nov. 13-16? Also happy to grab coffee, whatever’s easiest.  
Hi there,  Absolutely. When are you free for a chat? You can always text me tomorrow to see if I'm available. 8605979305.  Warmly, Jas  
Hi Im in the office today until 2:30. Will you be in or should we schedule a call?  
Hi Kelli, Thanks for your patience! Let's do a call next week to solidify everything. I have an idea that might work for both of us :) Can you talk on Monday, Wednesday or Friday next week? Thanks! Breann  

new thread with id: 192ee6458e43293f
this thread message is as follows
Hello,  My name is Annette Reich and I am interested in hosting my wedding reception at Big Sur River Inn. As directed by the website, I am emailing this address to hopefully learn of rates and scheduling.  Currently, we are looking at Summer of 2025. Our party would not exceed thirty people. We are looking forward to hearing from you!   Thank you, Annette Reich & Jagger King  
Hello,  My name is Annette Reich and I am interested in hosting my wedding reception at Big Sur River Inn. As directed by the website, I am emailing this address to hopefully learn of rates and scheduling.  Currently, we are looking at Summer of 2025. Our party would not exceed thirty people. We are looking forward to hearing from you!   Thank you, Annette Reich & Jagger King  
Hello Big Sur River inn events coordinator,   My name is Sierra and I was wondering if I could get more information on your venue. My fiancé Ethan and I have driven by many times and think your hotel is beautiful! We are planning to have about 100 people at our wedding and wanted to have a ceremony looking out at the river. We would like to get married in may or august of 2025. We were wondering what pricing was like for the venue as well as pricing for a reception at your restaurant. Also we saw that for parties you can do wedding cakes/ rental equipment/ photography and were wondering if you had any more information about that.   Thank you for your time,  Sierra and Ethan (702) 539-8747 Wardsm16@gmail.com
Hi, Big Sur River Inn!  Can you share more information on hosting a wedding on site? I'm specifically curious how many people can attend?  Thank you!  *--*  *Jennifer L. Schmit* 

new thread with id: 19201c02d0a897ae
this thread message is as follows
Thank you for letting me know! Good luck to you both and please come see us someday!  Breann  
Hello Breann - I’m back in the office today if you have any time to talk. Thank you   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com   On Jun 8, 2024, at 2:31 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Sorry we missed each other! I am running around this weekend with events...can we connect on Monday? Anytime. Hope you're having a great weekend!  Breann  
Thanks so much, Breann! M  
Hi Breann,  My phone number is 443-949-5070 - we're ready whenever!  Thanks, Jenn  

new thread with id: 192ad5d7bf25df78
this thread message is as follows
Glad to hear you found a venue. Good luck to you both! Breann  
Wonderful news - thank you so much.  Breann - I’m available via cell or email at your convenience. I look forward to hearing from you!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 4, 2024, at 3:00 PM, Events Team <events@bigsurriverinn.com> wrote:  Hi Lia, Thanks for reaching out. We would love to accommodate Mr. Fertitta for dinner on November 8. We have indoor and outdoor private dining options. I will have Breann, our Events Director, give you a call when she gets in tomorrow if that's ok with you.  I cc'd her on this email as well. Have a great day!   
Hello Breann - I’m back in the office today if you have any time to talk. Thank you   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com   On Jun 8, 2024, at 2:31 PM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Sorry we missed each other! I am running around this weekend with events...can we connect on Monday? Anytime. Hope you're having a great weekend!  Breann  
Breann - my apologies that I missed calling you back yesterday afternoon - the day got away from me. By chance are you available at any time today?  Thanks!   Lia D'Alessio Assistant to Lorenzo J. Fertitta Office: 702-495-3297 Cell: 702-523-5663 Lia@fertitta.com    On Jun 6, 2024, at 10:16 AM, Breann Fortier <breann@bigsurriverinn.com> wrote:  Hi Lia, Hope you are doing well today! We are excited that Mr. Fertitta is coming to visit Big Sur. What a change of pace from Vegas.  I have multiple options for you...I'll be able to guide you toward the most suitable space and menu once I hear a few more details. Can I call you this afternoon?  Looking forward to connecting!  Breann  It's a beautiful day at River Inn! Check out our LIVE CAME HERE :)<x-msg://148/It's%20a%20beautiful%20day%20at%20River%20Inn!%20Check%20out%20our%20LIVE%20CAME%20HERE%20:)>  [https://ci3.googleusercontent.com/mail-sig/AIorK4zkbjDTQ88A3AQx3Wt8rprkk68Hl1lG2DOdKxG47kUSYtKP8qRqX4_DM3mRm5wMv12rH0yOk6dzHo6Z]   

new thread with id: 192b5a5d95c1ed39
this thread message is as follows
Hi Ashley, I'm glad you like the live cam, me too! I check it when I'm not at work lol... I would love to show you and your partner around on Nov. 23. My schedule is pretty open and I have a colleague who helps me out with tours if needed. If you would like me to hold a date until your tour, I would be happy to do so. If I get a serious inquiry, I will reach out and let you know.  Did you have a date in mind?  Warm Regards, Breann  
Hello! Thank you for sending the brochure and menus. Everything looks so amazing and I especially love the live cam of the property, what a nice touch. What is needed to secure a date? I would also like to set a date to come tour the property sometime next month if you can let me know what availability you have I think Saturday 11/23 works great on our end but let me know if that would work for you, thank you!  
Thank you!  We're doing some more research but definitely wanted to find out when you schedule tours to check out the venue. Maybe a Saturday in early December? Also we are looking at either 5/31/25 or 8/2/25 if either of those dates are available..  Sha'e C  
Hi Breann,  We are definitely interested! The photos are absolutely gorgeous. I’ve been to the River Inn several times growing up and it was always a fun and special experience! We’d likely lean towards the Nov 1st since the 8th is booked.  I would love to get a little more information on pricing breakdowns and what is included so we can confirm that this fits into our budget.  Thank you very much! Cas  

new thread with id: 192e3931492e2141
this thread message is as follows
Hi Michael and Zahara, Hello! I'm sorry no one reached out!! We would love to be considered for your wedding. Are you available tomorrow for a call? I'm open tomorrow so anytime should work. Looking forward to connecting!  Have a wonderful day! Breann   
Hi there, Just following up to see if we can meet on Monday or Tuesday to see your venue and discuss my son’s wedding, while I’m in town. Warmly, Molly 720-236-6559  
Hi Breanne,  It was great meeting you this weekend.  I’d love to connect and see if we might be able to offer our services to your guests.  Please let me know if you’d like to set up a time to chat.  Thanks, Raquel  carmelbohopicnics.com 
Before we connect, could you send me your wedding package brochures please so that I can review before we connect?  Thank you!  Warmly, Jas  

new thread with id: 192e2298ebaf64e5
this thread message is as follows
Hi,  I hope you’re doing well!  Would you be interested in acquiring the National Association of Convenience Stores Attendees Email Lists 2024?  The list includes: company or organization name, first name, last name, full name, contact job title, verified email address, website URL, mailing address, phone number, industry, and many more.  Number of contacts    : 26,798 verified contacts. Cost                              : $1,789  1. Provide me more details that I'm interested in purchasing.. 2. OPT-OUT  Regards,  Kya Liam 
Hi,  I hope you’re doing well!  Would you be interested in acquiring the NACS Show Attendee Email List 2024?  List Includes: Company/Org Name, First Name, Last Name, Full Name, Contact Job Title, Verified Email Address, Website URL, Mailing address, Phone number, Industry and many more…  Number of Contacts: 26,763 Verified Contacts Regular Cost: $1,789 Special Discount: $1,589 (Limited-time offer)  If you’re interested please let me know I will assist you with further details.  Kind Regards, Elina Andrew Marketing Coordinator  To unsubscribe kindly reply with "Leave Out" in the subject line. 
Hey, I was just checking in to see if you received my last 2 emails. I know you are probably very busy, we just wanted to get more info so that we can book a venue soon. Thank you!  Nikki Cory  
Hi there,  I'm interested in your private events packages and pricing for my wedding next year, can you please forward more information?  Thanks! Ali 

new thread with id: 192c1f4f48973429
this thread message is as follows
Hi Shae, Luckily, we do have those dates available! I would love to show you around anytime you can come down. Let me know if I can help you navigate a trip down to Big Sur.  Have a great day! Breann  
Hi Breann,  Thank you for all the information.  Your "The Perfect Day" Elopement package looks AMAZING.   It'd be great to jump on a call or video call soon, (we actually may drive down to Big Sur on Saturday just to check out via a drive by).  I may also be jumping the gun, (but do you have any availability that Saturday (3/22/2025) for a separate reception?  Thank you, David & Kristin  
Hello, I'm interested in having my wedding at Big Sur River Inn on July 9, 2025 for approximately 25 people.  Please let me know if this date works for you and what packages you offer.  I look forward to hearing from you.  Thanks,  Amber Hudson 
Hi there,  Me and my partner (David Klech) are interested in your venue for an elopement with our parents 3/19/2025 (the date is flexible, but preferably during this week.).  We've spent many dates and memories in the Big Sur area, and would love to get married there.  Let us know if you have any availability and next steps.  Thanks, David Klech & Kristin Southard 

new thread with id: 192d9e232769709a

new thread with id: 192d542c448f9894

new thread with id: 192d437097806d07

new thread with id: 192ca51f3d90831f

new thread with id: 192ca5383e10b410

new thread with id: 191c52c0ce2ac22a

new thread with id: 192c05c76ac48bce

new thread with id: 192bce40d4cda15a

new thread with id: 192ba7f11c546aa7

new thread with id: 192ba62f549e3af7

new thread with id: 192b7d9d7ea08788

new thread with id: 19264396d0752a53

new thread with id: 192b23dd71bc8209

new thread with id: 192b0573b4ec7b45

new thread with id: 1929d2524b4f20e7

new thread with id: 191538a326395ba7

new thread with id: 19292645b7ffc9c3

new thread with id: 1929215945f06e76

new thread with id: 1928c5a5eacf877a

new thread with id: 1928c59a3e3154f7

new thread with id: 192826c1b8ab6398

new thread with id: 19196619dd6c3090

new thread with id: 1916b43121c3c27d

new thread with id: 1924eeab43a2a64e

new thread with id: 192730161154dde4

new thread with id: 19249777585ef1f3

new thread with id: 19268ce555e0aaa9

new thread with id: 1924a66d106172be

new thread with id: 19267892f7d9d295

new thread with id: 192654f9580919ba

new thread with id: 1926e7d54ccb356f

new thread with id: 191ee1f7ff176a1d

new thread with id: 192636d1e0c72fc7

new thread with id: 1925ee2ea274fa0f

new thread with id: 192595eb5a8c51a6

new thread with id: 19224b4d613fc5d3

new thread with id: 191d4148fb8f2a26

new thread with id: 191a5eb20fd7186e

new thread with id: 1922f6fe1437818f

new thread with id: 1923e9681bae0be4

new thread with id: 192358b7c3bd9fbd

new thread with id: 18fe514969ed53f3

new thread with id: 1922eef917c52ecb

new thread with id: 191c41a08154564b

new thread with id: 1921bd4f617da7c4

new thread with id: 19221dad668bb220

new thread with id: 191cea8098dc697a

new thread with id: 19113b573998c724

new thread with id: 1921ce618e0bcbe7

new thread with id: 1921d4f95a6b8595

new thread with id: 19217800f6718ddb

new thread with id: 1921cbdbb4050cbd

new thread with id: 1921c43b18c520ec

new thread with id: 1921c414cede5765

new thread with id: 192120795f1f137b

new thread with id: 192084c4b0a11201

new thread with id: 191fda6d9cf8d9c3

new thread with id: 1920605a159bdeef

new thread with id: 1920226cbc0045d0

new thread with id: 192016e6774625dd

new thread with id: 1920147bbaae12d4

new thread with id: 192010d1538b9afc

new thread with id: 191d0acc0511d7e8

new thread with id: 191f85eca2acb85e

new thread with id: 191d96384bfea71d

new thread with id: 191f24a4a9ca0c3a

new thread with id: 191ee6406cc9429e

new thread with id: 191be9b0aa81437e

new thread with id: 191ee36c1464bd0a

new thread with id: 191e8d4b90594cb1

new thread with id: 19194e97148ff558

new thread with id: 191e70837c48f2d5

new thread with id: 191de948b90458d5

new thread with id: 191de3d960e9a315

new thread with id: 18f7858240acbf66

new thread with id: 191d834bba746b83

new thread with id: 1919ac5c0c27414f

new thread with id: 191d2568cdf6db3c

new thread with id: 191d57acb0d0ea54

new thread with id: 191d576eb8abf7d3

new thread with id: 191c9f95342a02fd

new thread with id: 191c8bb83f5505f9

new thread with id: 191c5e4cdfe04b8d

new thread with id: 19191e49ce557fdd

new thread with id: 19181465c84c11c3

new thread with id: 191b4dc18d930777

new thread with id: 191b4dbf6b52652e

new thread with id: 191974960a73354c

new thread with id: 191a470dcd6b795c

new thread with id: 191a1c0a65ff5c17
