Hello Zach,

Thank you for your continued interest in hosting your event at the Big Sur River Inn! We're excited to help plan a memorable experience for you and your guests. Here’s a brief overview of our activities and their respective pricing:

1. **Guided Tours**: Explore the scenic wonders of Big Sur with a local guide. Prices start at $50 per person for group tours.
2. **E-bike Tours**: Venture through trails and along the coast on an electric bike. E-bike rentals are $80 per person, which includes a half-day tour.
3. **Massage Services**: Relax and unwind with a therapeutic massage, available from $120 for a 60-minute session.
4. **Yoga Sessions**: Join a group yoga class in the beautiful outdoors for $35 per person or book a private session for $90.
5. **Art Classes**: Get creative and inspired by the natural beauty of our surroundings, with classes starting at $40 per person.

We’d love to discuss these options further and tailor the activities to fit the flow of your event. Feel free to let us know a convenient time for a call, or we can continue to coordinate details via email.

Thank you once again, Zach. We look forward to making your event an unforgettable experience!

Sincerely,

Breann

Events Team, Big Sur River Inn
46800 Hwy 1, Big Sur, CA 93920

Be sure to check out our live cam for current views of the river and surroundings! <https://www.bigsurriverinn.com/weather-and-live-camera>
Hello Emma,

Happy to hear that you're interested in reserving accommodations for your guests at the Big Sur River Inn for your special weekend! We are thrilled to be considered a part of these wonderful moments. 

For a group of 20-30 people, we can certainly arrange a block of rooms. As you're looking into accommodations only for Friday and Saturday night, here’s what we can offer:

- **Room Types Available**:
  - Single Queen Rooms: $345/night
  - Double Queen Rooms: $395/night
  - Riverside Suites: $515/night

- **Room Block Details**:
  - We would secure a block of rooms specifically for your guests. In case more rooms are needed or you have fewer guests than anticipated, adjustments can be made up to 30 days before the event.
  
- **Reservation Process**:
  - We would provide you with a block code specific to your group, which your guests can use when booking directly. This ensures they receive the group rate and are counted within your block.

- **Deposit & Payment**:
  - No deposit required for the block. Each guest will pay for their own room. We just require a credit card on file to secure the block.

Please let us know if this arrangement meets your needs, or if there’s anything specific you would like us to include or adjust. We can tailor everything to ensure it’s as seamless and fitting for your plans as possible.

Looking forward to potentially helping make your weekend both relaxing and memorable!

Best regards,

Breann  
Events Team  
Big Sur River Inn
Hello,

Thank you so much for your interest in hosting your event at the Big Sur River Inn! We would be delighted to explore the possibilities with you.

We are available for a phone call between November 13-16 as you suggested. Could you please provide a specific date and time that works best for you, given your current schedule? We are happy to accommodate you given the time difference. Additionally, if you have any preliminary questions or details you would like to discuss about the event, feel free to let us know. 

Looking forward to connecting with you soon!

Warm regards,
Breann
Big Sur River Inn Events Team
Hi Annette and Jagger,

Thank you for reaching out to us with interest in hosting your wedding reception at Big Sur River Inn. We would be delighted to provide you with a memorable setting for your special day.

Could you please specify which month in the summer of 2025 you are considering for your event? Once I have a bit more detail, I can check our availability and provide you with a detailed quote for our services and amenities.

Our venue offers a stunning backdrop of the Big Sur River, perfect for intimate gatherings like yours. With options for outdoor and indoor celebration spaces, we ensure a magical experience regardless of weather conditions.

I've attached a link to our catering packet, which outlines our menu options and pricing for meals per person, which typically range from $65-$85. This will give you a general idea of what we can offer: [Catering Packet](https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit)

Additionally, should you be interested in booking accommodations for your guests, we can arrange a room block at a locked-in rate to ensure everyone's comfort during their stay.

I look forward to hearing more about your plans and how we can make your day as perfect as you envision. Let's schedule a call or a visit to our venue at your convenience.

Wishing you a great day!

Warm regards,

Breann  
Events Coordinator, Big Sur River Inn  
events@bigsurriverinn.com  
831-333-6774
Hello Valerie and Cas,

Thank you for considering Big Sur River Inn for your special occasion. We understand that selecting the right venue is essential and we wish you the best as you move forward with your plans.

Should you have other events in the future or if anything changes, we’d love to have the opportunity to host you.

Warm regards,
Breann
Hello,

Thank you for reaching out about hosting your event at the Big Sur River Inn. We're excited to potentially accommodate your group in all 22 rooms! Regarding rolling meals into the invoice for your group, we can definitely arrange that to streamline the process for you.

To move forward in creating a tailored quote, could you please provide more specifics regarding the following:
- The preferred dates for your event
- The number of guests you anticipate
- Meal preferences or any dietary restrictions we should be aware of
- Any additional events or services you would like included during the stay (e.g., welcome drinks, rehearsal dinner, etc.)

Once we have this information, we can provide a detailed quote and further discuss meal plans and other logistics to ensure a memorable event for you and your guests.

Looking forward to hearing from you!

Best regards,

River Inn Events Team
Hi Emma and Jackson,

Thank you so much for considering the Big Sur River Inn for your special event. While we're sorry to hear that you've chosen another venue, we wish you both nothing but the best as you prepare for your upcoming celebration.

If there's anything else you need or if your plans change, please don't hesitate to reach out. We'd love to have the opportunity to host your event in the future.

Warmest wishes,
Breann 
Events Team 
Big Sur River Inn
46800 Hwy 1, Big Sur, CA 93920
Breann@bigsurriverinn.com

P.S. Don't forget to check out our live cam for a little slice of Big Sur anytime! <https://www.bigsurriverinn.com/weather-and-live-camera>
Hi Emma,

Thank you for your interest in hosting your event at the Big Sur River Inn! We're thrilled to help you with your wedding plans.

For August 15 and 16, 2025, we are currently available and would love to accommodate your special day. Our event space can cater to a range of activities, whether it's a ceremony by the river, a lively reception, or both!

Regarding costs, we offer various packages depending on your needs. Typically, venue fees start at $5,000, which includes exclusive use of the selected event spaces. Our catering services range from $65-$85 per person, offering a variety of menu options that can be tailored to your preferences. You can check out our detailed catering packet here for more specifics on menu selections and pricing: [Catering Packet](https://docs.google.com/document/d/1H036K69MykxEqGDHxpX6RVL1N9gqkLs8fTgSOLhnYUw/edit).

In addition, we can create a block of rooms for your guests, providing them with a comfortable stay right where the celebration is. To secure this, a deposit is required, and the rates for rooms would be guaranteed at the time of booking.

I'd love to discuss this further and answer any questions you may have! When would be a good time for you to have a call or visit us for a tour? Please let me know your convenience, and we can arrange something that suits your schedule.

Looking forward to hearing from you and hopefully planning this wonderful event together!

Best,

Events Team
Big Sur River Inn
46800 Hwy 1, Big Sur, CA 93920
events@bigsurriverinn.com
Hello Michael and Zahara,

Thank you so much for your email, and our sincerest apologies for the delay in response. We would be absolutely delighted to discuss the possibility of hosting your wedding at the Big Sur River Inn next year!

Please let us know what times would be convenient for you to schedule a call. We are happy to accommodate your schedule as best as we can, so we can explore how to make your special day everything you’ve envisioned. Additionally, if you would like to take a tour of the venue, we would love to arrange that as well.

Looking forward to hearing back from you and helping plan your magical day!

Warm regards,

Breann
Events Team
Big Sur River Inn
events@bigsurriverinn.com
831-333-6774
Hi Kya,

Thank you for reaching out to us! At this time, we are more focused on planning and hosting events, such as weddings and special gatherings, at our Big Sur River Inn location. We appreciate your offer but will have to politely decline acquiring the National Association of Convenience Stores Attendees Email Lists 2024.

Please keep us in mind for any event-related opportunities or if there's anything else that might align more closely with our business in the future.

Wishing you the best with your initiatives!

Best Regards,

Events Team
Big Sur River Inn
46800 Hwy 1, Big Sur, CA 93920
Visit us for live riverside views anytime! <https://www.bigsurriverinn.com/weather-and-live-camera>
